{
  "type": "list",
  "data": [
    {
      "id": "legal_001",
      "title": "Cai Haosheng Theft and Fraud Case",
      "problem": "Issue: The defendant secretly used the victim's identity to obtain a loan (Ant Borrow) into the victim's account, then induced the victim to transfer the funds by concealing the truth and fabricating facts. Does this constitute fraud? Guidance: Distinguish amounts obtained by secret taking (theft) versus amounts obtained by later deception (fraud).",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2017 Amendment) Article 264",
          "PRC Criminal Law (2017 Amendment) Article 266",
          "PRC Criminal Procedure Law (2012 Amendment) Article 225(1)(i)"
        ],
        "judgment_guidance": "If loan application secretly misappropriated account usage/credit, evaluate as theft; amounts later induced by deception may be evaluated as fraud; amounts counted accordingly."
      },
      "expected_verdict": "First-instance: conviction for theft and fraud with combined punishment; second-instance: judgment upheld.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "theft and fraud"
    },
    {
      "id": "legal_002",
      "title": "Chen Jiaying Credit Card Theft Case",
      "problem": "Issue: Binding another's bank card to one's own platform with acquired identity information without the owner's knowledge, and disposing of the funds, constitutes theft of a credit card function and thus theft?",
      "prompt_tips": {
        "laws": [
          "Interpretation on Handling Criminal Cases that Hinder Management of Credit Cards (Art. 5)",
          "PRC Criminal Law (2015 Amendment) Article 196(3)",
          "PRC Criminal Law (2015 Amendment) Article 264"
        ],
        "judgment_guidance": "Secret binding and direct disposition of account funds constitutes secret taking of credit card function; treat as theft."
      },
      "expected_verdict": "Convicted of theft; imprisonment 1 year 6 months, probation 1 year 6 months, and a fine.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "credit card theft"
    },
    {
      "id": "legal_003",
      "title": "Fang Yue and Others: Organized Crime (Soft Violence, Loan Sharking)",
      "problem": "Issue: Engaging in organized unlawful acts (e.g., 'loan sharking') mainly using 'soft violence'—does this constitute an organized crime group?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 294",
          "Opinions on Handling 'Loan Sharking' Criminal Cases (relevant articles)",
          "Opinions on Handling 'Soft Violence' Criminal Cases (Art. 4)"
        ],
        "judgment_guidance": "If organizational features, economic power, behavioral features, and harmful impact are present, recognize as organized crime; multiple offenses punished together."
      },
      "expected_verdict": "First- and second-instance: convictions for organizing/leading/participating in organized crime; combined punishment; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "organized crime"
    },
    {
      "id": "legal_004",
      "title": "Gong Pinwen and Others: Organized Crime (Equity Profit-Sharing Model)",
      "problem": "Issue: Recruiting members via equity profit-sharing and distributing criminal proceeds by 'shares', with stable size and clear leadership—does this meet organizational features of organized crime?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 294",
          "Guiding Opinions on Handling Criminal Cases of Underworld Forces (Art. 9)",
          "Opinions on 'Soft Violence' Criminal Cases (Art. 4)"
        ],
        "judgment_guidance": "Profit-sharing does not negate organizational nature; sustained multi-offense behavior supports organized crime and combined punishment."
      },
      "expected_verdict": "Second-instance: maintains combined punishment for organizing/leading organized crime.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "organized crime"
    },
    {
      "id": "legal_005",
      "title": "Gu Jing: Computer System Damage vs Theft",
      "problem": "Issue: Intruding a game company's database to tamper with virtual data for profit—does it constitute the crime of damaging computer information systems or theft?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 264",
          "PRC Criminal Law (2011 Amendment) Article 286",
          "Relevant sentencing norms (leniency: voluntary surrender, probation)"
        ],
        "judgment_guidance": "Absent major system damage and with core harm being unlawful appropriation of virtual assets, theft evaluation is more appropriate."
      },
      "expected_verdict": "Convicted of theft; imprisonment 2 years, probation 2 years, and a fine.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "computer and virtual property"
    },
    {
      "id": "legal_006",
      "title": "Guo Li: Extortion Retrial Acquittal",
      "problem": "Issue: Demanding money conditioned on exposure of wrongdoing, where the actor is the victim and evidence fails to prove intent to illegally possess—does it constitute extortion?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2017 Amendment) Article 274"
        ],
        "judgment_guidance": "If unlawful possession intent cannot be proved and there is a rights-remedy context, do not convict for extortion."
      },
      "expected_verdict": "Retrial quashes original conviction; not guilty declared.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "extortion / acquittal"
    },
    {
      "id": "legal_007",
      "title": "Li: Platform Settlement Loophole Fraud",
      "problem": "Issue: Knowing settlement loopholes, fabricating transactions and exploiting refund prepayment mechanisms to profit—constitutes fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 266"
        ],
        "judgment_guidance": "Continuous exploitation of system loopholes with fabricated transactions to obtain prepayments constitutes fraud."
      },
      "expected_verdict": "Convicted of fraud; imprisonment 3 years, probation 4 years, and a fine.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "online platform fraud"
    },
    {
      "id": "legal_008",
      "title": "Qian Jianhua: Contract Fraud and Embezzlement (Revised on Appeal)",
      "problem": "Issue: Carrier, with intent to illegally possess, intercepts goods under a 'reasonable loss' clause and fabricates losses—contract fraud? Combined punishment with embezzlement?",
      "prompt_tips": {
        "laws": [
          "Relevant Supreme People's Court/Procuratorate interpretations (reference)",
          "Interpretation on Embezzlement/Bribery Cases (Art. 11(1))",
          "PRC Criminal Law Articles 224, 271, 12, 69"
        ],
        "judgment_guidance": "Fabricating reasonable loss to obtain owner's property constitutes contract fraud; combined punishment with embezzlement; consider leniency factors."
      },
      "expected_verdict": "Appeal: combined punishment for contract fraud and embezzlement; imprisonment 2 years 11 months and fine; maintains embezzlement part.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "contract fraud / embezzlement"
    },
    {
      "id": "legal_009",
      "title": "Qiao Jinzhong: Infringement (Shares as Property Under Custody)",
      "problem": "Issue: Under certain conditions, do shares qualify as 'property under custody' for the crime of misappropriation/infringement?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 270"
        ],
        "judgment_guidance": "Shares can be property with disposability; unauthorized disposition under a custody relationship with intent to illegally possess constitutes misappropriation."
      },
      "expected_verdict": "First- and second-instance: convicted; imprisonment 3 years and fine; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "misappropriation of shares"
    },
    {
      "id": "legal_010",
      "title": "Ren Qing: Linked Offenses (Illegal Mobile Charges) as Theft",
      "problem": "Issue: Secretly deducting fees via remote illegal control of mobile information systems—when forming a linked offense with illegal control of computer systems and theft, should punishment be for theft?",
      "prompt_tips": {
        "laws": [
          "Interpretation on Theft Cases (Art. 13)",
          "Interpretation by the NPC Standing Committee on Criminal Law Article 30",
          "PRC Criminal Law (2015 Amendment) Article 264"
        ],
        "judgment_guidance": "Where property acquisition is the primary legal interest harmed, impose punishment for the more serious offense; treat as theft."
      },
      "expected_verdict": "Convicted of theft; sentences from 7 to 15 years for different defendants; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "info-system deduction / theft"
    },
    {
      "id": "legal_011",
      "title": "Tan Zhijian Theft Case (Vehicle in Marital Dispute)",
      "problem": "Issue: Unauthorized possession and use of ex-wife's car—does it constitute theft despite civil dispute background?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 264",
          "Theft Judicial Interpretation Art. 1 (reference)"
        ],
        "judgment_guidance": "Secret taking with intent to illegally possess and long-term refusal to return constitutes theft."
      },
      "expected_verdict": "First-instance: theft, 3 years and fine; retrial acquittal (final: not guilty).",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "theft (retrial acquittal)"
    },
    {
      "id": "legal_012",
      "title": "Wang JumIng & Lu Xiaodi: Environmental Pollution",
      "problem": "Issue: Illegally dumping solid waste causing ecological damage and high losses—does it constitute 'serious environmental pollution' with 'especially serious consequences' under Art. 338?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 338",
          "Solid Waste Pollution Prevention Law Article 22",
          "Interpretation on Environmental Pollution Criminal Cases Art. 3(5)",
          "Jiangsu Provincial Regulation on Solid Waste Prevention Art. 51(3)"
        ],
        "judgment_guidance": "Entering first-class protected areas with serious ecological risks and significant losses constitutes serious environmental pollution; heavier punishment."
      },
      "expected_verdict": "Convicted; 5y6m and 5y imprisonment with fines; upheld on appeal; related fraud handled separately.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "environmental pollution"
    },
    {
      "id": "legal_013",
      "title": "Wang Lizhi Fraud Case (Acquittal on Appeal)",
      "problem": "Issue: Continuous business use of loans, no squander/high-risk investment, no absconding, active remediation—sufficient to negate intent to illegally possess and thus not fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Procedure Law (2012 Amendment) Article 195(3)",
          "PRC Criminal Procedure Law (2012 Amendment) Article 225(3)"
        ],
        "judgment_guidance": "Assess fund usage, repayment intent and ability, and post-event conduct; if illegal possession intent unproven, not fraud."
      },
      "expected_verdict": "Second-instance quashes original judgment; not guilty declared.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "fraud / acquittal"
    },
    {
      "id": "legal_014",
      "title": "Wang Xiaodong Theft (Platform Settlement Error Exploitation)",
      "problem": "Issue: Merchant knowingly exploiting platform settlement errors via self-buy/self-sell 'brush orders' to withdraw funds—legal characterization?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 264"
        ],
        "judgment_guidance": "Using system errors to secretly obtain platform funds infringes property interests; treat as theft."
      },
      "expected_verdict": "Convicted of theft; imprisonment 12 years, deprivation of political rights 2 years, and fine; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "platform vulnerability theft"
    },
    {
      "id": "legal_015",
      "title": "Wang Yong: Rape, Extortion (Evidence-Based without Confession)",
      "problem": "Issue: Cases with weak objective evidence and no confession—how should courts decide?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Procedure Law Article 53"
        ],
        "judgment_guidance": "Adhere to evidence-based adjudication; confession is not legally necessary; if evidence chain reaches beyond reasonable doubt, conviction is permissible."
      },
      "expected_verdict": "Second-instance maintains death penalty and submits to SPC; SPC approves death sentence.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "evidence-based adjudication / death penalty approval"
    },
    {
      "id": "legal_016",
      "title": "Wu Qiang et al.: Extortion, Robbery, Drug Trafficking, Intentional Injury (Criminal Group)",
      "problem": "Issue: Is 'doing evil and oppressing the people' a key distinction between a criminal group of malign influence and an ordinary criminal group?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 25",
          "Guiding Opinions on Handling Crimes of Malign Influence (Arts. 15, 4, 5)"
        ],
        "judgment_guidance": "Key factors: relatively stable membership, repeated offenses using violence or soft violence, and adverse social impact."
      },
      "expected_verdict": "Main offender Wu Qiang: combined punishment for multiple crimes to 13 years 6 months and fine; others sentenced; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "criminal group of malign influence"
    },
    {
      "id": "legal_017",
      "title": "Xiao Jun Fraud Retrial Acquittal",
      "problem": "Issue: Is failure to repay due loans necessarily fraud?",
      "prompt_tips": {
        "laws": [
          "Key holdings in retrial procedure documents (reference)"
        ],
        "judgment_guidance": "Intent to illegally possess is key; civil breach should not be generalized as criminal fraud."
      },
      "expected_verdict": "Retrial: acquittal.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "fraud / retrial acquittal"
    },
    {
      "id": "legal_018",
      "title": "Yan Xianpeng Theft (Not Returning Found Phone)",
      "problem": "Issue: Phone lost in a crowded public place with owner unaware; finder keeps and does not return—does this constitute secret taking of property (theft)?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 270",
          "PRC Criminal Law Article 264"
        ],
        "judgment_guidance": "Property left the owner's actual control and actor has intent to illegally possess; meets theft elements."
      },
      "expected_verdict": "First-instance: theft, fine; appeal: judgment upheld.",
      "difficulty": "easy",
      "category": "legal",
      "subcategory": "found-and-not-returned / theft"
    },
    {
      "id": "legal_019",
      "title": "Zhang Weixiang et al.: Providing Bank Cards and POS for Fraud (Accomplice)",
      "problem": "Issue: Knowingly providing bank cards/POS machines for telecom fraud and helping transfer illicit funds—accomplice to fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 266",
          "PRC Criminal Law Article 177-1(1)",
          "Interpretation on Fraud Criminal Cases Art. 7"
        ],
        "judgment_guidance": "Providing tools and sharing proceeds show joint intent and assistance; treat as accomplice to fraud; may also violate credit card management."
      },
      "expected_verdict": "Main offenders: combined punishment up to 13 years 6 months and fines; others sentenced; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "telecom fraud accomplice / credit card management"
    },
    {
      "id": "legal_020",
      "title": "Mai Zanxin Embezzlement/Misappropriation (Final Acquittal)",
      "problem": "Issue: For a majority shareholder transferring projects and funds among related companies, without proof of intent to illegally possess or illegal use, do crimes of embezzlement/misappropriation establish?",
      "prompt_tips": {
        "laws": [
          "SPC Interpretation on Criminal Procedure Law Article 389(2)"
        ],
        "judgment_guidance": "Absent intent to illegally possess or elements of illegal use, do not convict for embezzlement/misappropriation."
      },
      "expected_verdict": "Retrial: acquittal; prosecution appeal rejected; final acquittal maintained.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "embezzlement/misappropriation acquittal"
    },
    {
      "id": "legal_021",
      "title": "Chen Jianping: Fake Cancer Therapy Fraud",
      "problem": "Issue: With intent to illegally possess, setting up a scam to induce patients/families to accept fake treatment or buy drugs for money—legal characterization?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 266",
          "PRC Criminal Law Articles 25, 26, 27",
          "PRC Criminal Law Articles 52, 53, 54, 59 (related)"
        ],
        "judgment_guidance": "Fabricating facts to obtain property in huge amounts constitutes fraud; proceeds to be recovered by law."
      },
      "expected_verdict": "First-instance: fraud, 8 years and fine; upheld on appeal.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "medical scam / fraud"
    },
    {
      "id": "legal_022",
      "title": "Chen Jiang & Chen Kecheng: Large-Scale Online 'Nude Chat' Fraud",
      "problem": "Issue: For mass online fraud with many victims across regions, how to determine total criminal amount in trial?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 266",
          "PRC Criminal Law Article 25(1)",
          "PRC Criminal Law Article 64"
        ],
        "judgment_guidance": "Comprehensively rely on payment platform flows, bank transaction details, and victim sample testimonies to determine the total amount."
      },
      "expected_verdict": "Main offenders: fraud, 11y6m and 12y6m with fines; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "mass online fraud"
    },
    {
      "id": "legal_023",
      "title": "'Bar Companion' Expensive Fraudulent Consumption",
      "problem": "Issue: Inducing exorbitant consumption through fake dating to obtain money—fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 266",
          "PRC Criminal Law Article 25(1)"
        ],
        "judgment_guidance": "Fabricating facts (relationship, prices) with intent to illegally possess and inducing excessive payments constitutes fraud."
      },
      "expected_verdict": "Convicted of fraud; imprisonment and fines (56 victims, total ~135,000 RMB); accessories handled leniently.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "consumer fraud"
    },
    {
      "id": "legal_024",
      "title": "Ding Yonggang: Robbery by Carrying Weapon during Snatch",
      "problem": "Issue: Carrying a weapon while snatching, even without using or brandishing it, poses immediate threat to personal safety—punish as robbery?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 263",
          "SPC Interpretation on Robbery Cases Art. 6",
          "SPC & SPP Interpretation on Snatching Cases Art. 2(4)"
        ],
        "judgment_guidance": "Carrying a weapon during snatching implies potential violence; punish as robbery with heavier penalty."
      },
      "expected_verdict": "Robbery: main offender 4y6m and fine; plus snatching combined to 4y9m; accomplices sentenced accordingly.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "conversion to robbery"
    },
    {
      "id": "legal_025",
      "title": "S. Shipping Co. v. G. Logistics Holdings — Recognition of UK Court Judgments (Reciprocity Test)",
      "problem": "Issue: In an application to recognize UK High Court and Court of Appeal judgments arising from ship lease guarantee disputes, how should a Chinese court assess reciprocity under CPL Art. 289 where China and the UK have no relevant treaty and there is no prior UK case recognizing a PRC judgment? Further, does a UK court’s use of PRC judgments/civil rulings as evidence constitute 'recognition and enforcement' of PRC judgments? Guidance: Examine whether, under the foreign forum’s domestic law, PRC civil/commercial judgments are generally recognizable/enforceable (de jure reciprocity), and confirm that mere evidentiary reference to PRC decisions is not the same as recognition/enforcement; also screen for public policy, jurisdiction, punitive damages, and other refusal grounds.",
      "prompt_tips": {
        "laws": [
          "PRC Civil Procedure Law (2021 Amendment) Article 289"
        ],
        "judgment_guidance": "Reciprocity does not require a prior foreign case recognizing a PRC judgment; if, under the foreign state’s law, PRC civil/commercial judgments are recognizable/enforceable in principle, reciprocity may be found. A foreign court citing PRC judgments/rulings as evidence is not 'recognition and enforcement'. Absent violations of PRC basic principles, sovereignty/security, or public interest—and where jurisdiction was accepted by agreement and the debtor participated—recognition should be granted; contractual interest/fees for non-performance are not 'punitive damages' excluded from recognition."
      },
      "expected_verdict": "Court granted recognition of the UK High Court [2015] EWHC 718 (Comm) judgment and related orders (2015–2018), and the UK Court of Appeal [2016] EWCA Civ 982 judgment and related orders; ruling effective upon service.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "recognition & enforcement of foreign judgments"
    },
    {
      "id": "legal_026",
      "title": "Foreign Arbitral Award Non-Recognition for Non-Foreign-Related Dispute",
      "problem": "Issue: Two PRC legal-person companies agreed to submit disputes with no foreign element to a foreign arbitral institution (Korean Commercial Arbitration Board). Should a PRC court recognize the resulting foreign award under the New York Convention?",
      "prompt_tips": {
        "laws": [
          "New York Convention (1958) Art. II, Art. V(1)(a), Art. V(2)(b)",
          "PRC Civil Procedure Law (2012 Amendment)",
          "PRC Arbitration Law (2009 Amendment)",
          "SPC Opinions on the Application of the CPL (Art. 304)",
          "PRC Law on Foreign-Invested Enterprises (2000 Amendment) Arts. 2, 8"
        ],
        "judgment_guidance": "Where both parties are PRC legal persons and the legal relationship and subject matter are entirely domestic, an agreement to submit to foreign arbitration violates mandatory PRC law and is invalid; a foreign award rendered on that basis shall not be recognized under Art. V(1)(a) and/or V(2)(b) of the New York Convention."
      },
      "expected_verdict": "Application to recognize the KCAB award dismissed by the Beijing No. 2 Intermediate People’s Court.",
      "difficulty": "medium",
      "category": "civil / non-litigation procedure",
      "subcategory": "recognition & enforcement of foreign arbitral awards"
    },
    {
      "id": "legal_027",
      "title": "Minority Shareholder–Initiated Compulsory Liquidation Due to Conflict of Interest",
      "problem": "Issue: May a minority shareholder seek court-ordered (compulsory) liquidation where majority shareholders, who owe large damages to the company and refuse to pay, would control a self-liquidation and thus face a direct conflict of interest?",
      "prompt_tips": {
        "laws": [
          "PRC Company Law (2018 Amendment) Arts. 183, 20",
          "SPC Interpretation (II) on the Application of the Company Law (2014) Art. 7(2)(ii), Art. 7(2)(iii), Art. 7(3)"
        ],
        "judgment_guidance": "If majority shareholders bear substantial liabilities to the company and cannot propose effective measures or provide security to ensure a lawful and timely self-liquidation, the court should accept a minority shareholder’s application for compulsory liquidation by reference to Company Law Interpretation (II) Art. 7(2)(ii)(iii) and (3)."
      },
      "expected_verdict": "On appeal, the Shanghai High People’s Court revoked the non-acceptance and ordered the lower court to accept the compulsory liquidation application.",
      "difficulty": "medium",
      "category": "corporate / insolvency",
      "subcategory": "compulsory liquidation (acceptance standards)"
    },
    {
      "id": "legal_028",
      "title": "Jurisdiction to Recognize Foreign Arbitral Award Based on Principal Place of Business",
      "problem": "Issue: For an offshore company registered in the Marshall Islands but carrying on business in Shanghai, may a PRC maritime court assume jurisdiction to recognize and enforce a London maritime arbitration award under the New York Convention?",
      "prompt_tips": {
        "laws": [
          "PRC Special Maritime Procedure Law Art. 11",
          "SPC Interpretation on the Application of the CPL (2020) Art. 3",
          "New York Convention (1958)"
        ],
        "judgment_guidance": "If evidence shows the respondent conducts business or maintains an office at the court locale, the site may be deemed the respondent’s principal place of business (domicile) in China; the maritime court at that locale has jurisdiction to accept an application to recognize and enforce the foreign award."
      },
      "expected_verdict": "Jurisdiction objection rejected; on appeal, Shanghai High People’s Court affirmed the maritime court’s jurisdiction.",
      "difficulty": "medium",
      "category": "maritime / arbitration enforcement",
      "subcategory": "recognition & enforcement of foreign arbitral awards (jurisdiction)"
    },
    {
      "id": "legal_029",
      "title": "Appointment of Estate Administrator: Standing of Non-heir Caregivers",
      "problem": "Issue: May persons who had no legal duty to support the decedents but in fact provided substantial care be deemed 'interested parties' entitled to apply to court to designate an estate administrator when the heirship is unclear or contested?",
      "prompt_tips": {
        "laws": [
          "PRC Civil Code Art. 1127",
          "PRC Civil Code Art. 1131",
          "PRC Civil Code Art. 1145",
          "PRC Civil Code Art. 1146",
          "PRC Civil Code Art. 1147",
          "PRC Civil Code Art. 230"
        ],
        "judgment_guidance": "Individuals other than heirs who provided substantial support to the decedent may be allocated appropriate estate and thus have a legal interest in the estate; they qualify as 'interested parties' and may petition the court to designate an estate administrator when disputes exist over the administrator."
      },
      "expected_verdict": "Court designated the local Civil Affairs Bureau as estate administrator upon application by the non-heir caregivers.",
      "difficulty": "medium",
      "category": "civil / non-litigation procedure",
      "subcategory": "estate administrator designation"
    },
    {
      "id": "legal_030",
      "title": "1+5 Substantive Consolidation Reorganization of Parent and Five Subsidiaries",
      "problem": "Issue: When may courts order substantive consolidation of multiple affiliated companies for reorganization, and how should a consolidated plan address asset advantages, creditor recoveries, and equity adjustments?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Arts. 1, 2, 86(2)"
        ],
        "judgment_guidance": "Where affiliated entities display highly commingled corporate personality (management overlap, shared finance/personnel, intertwined operations, large intercompany debts/guarantees) and segregation costs are excessive, courts may order substantive consolidation; intra-group claims are eliminated and a unified estate is distributed under a single plan, which may flexibly use cash plus debt-to-equity swaps and pre-vote mechanisms."
      },
      "expected_verdict": "Intermediate court ordered substantive consolidation of six affiliated companies and later approved the consolidated reorganization plan.",
      "difficulty": "hard",
      "category": "bankruptcy / reorganization",
      "subcategory": "substantive consolidation"
    },
    {
      "id": "legal_031",
      "title": "Liquidation-to-Composition for an SME Using Pre-Vote Rules",
      "problem": "Issue: For an SME with salvage value, can the court guide a shift from liquidation to composition and adopt pre-vote rules so that pre-balloted creditor consent carries over after conversion?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Arts. 95, 96(1), 97, 98"
        ],
        "judgment_guidance": "Where the debtor has going-concern value and creditors broadly support composition, courts may solicit pre-votes (including rules that carry forward to the formal composition meeting if no substantive changes occur) and, after hearing, convert to composition, recognize the agreement, and terminate the composition procedure."
      },
      "expected_verdict": "Court approved conversion to composition, recognized the composition agreement per pre-vote rules, and terminated the composition procedure.",
      "difficulty": "medium",
      "category": "bankruptcy / composition",
      "subcategory": "conversion from liquidation; pre-vote mechanism"
    },
    {
      "id": "legal_032",
      "title": "Listed Company Reorganization Concurrent with Major Asset Restructuring",
      "problem": "Issue: How to coordinate internal corporate governance and external regulatory approval when a listed company’s reorganization proceeds in parallel with a CSRC-regulated major asset restructuring?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Art. 86(2)",
          "Company Law (PRC, 2013 rev.)",
          "Securities Law (PRC, 2014 rev.)",
          "Administrative Measures for Major Asset Restructuring of Listed Companies (2016)"
        ],
        "judgment_guidance": "Under administrator-managed reorganization, retain the board/shareholders’ meeting to pass M&A/major asset resolutions while the administrator prepares the plan; activate the SPC-CSRC consultation mechanism and reference expert advisory opinions; upon creditor and equity group approval, the court may approve the plan that embeds the restructuring."
      },
      "expected_verdict": "Court approved the reorganization plan of the listed company and terminated the reorganization after consulting CSRC via the SPC-CSRC mechanism.",
      "difficulty": "hard",
      "category": "bankruptcy / listed companies",
      "subcategory": "reorganization with concurrent major asset restructuring"
    },
    {
      "id": "legal_033",
      "title": "Substantive Consolidation with Court-Approved Investor Trial Production",
      "problem": "Issue: During reorganization of substantively consolidated affiliates, may the court permit an investor to fund and commence trial production before plan approval to preserve core licenses and value?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Arts. 1, 2, 26, 86"
        ],
        "judgment_guidance": "If core licenses risk lapse, equipment risks depreciation, and funding is insufficient, the administrator may seek court leave for investor-funded trial production before plan approval; this preserves going-concern value, benefits creditors, and should proceed under court/administrator/creditor supervision."
      },
      "expected_verdict": "Court allowed investor trial production; later, creditor groups approved and the court sanctioned the reorganization plan and terminated the procedure.",
      "difficulty": "medium",
      "category": "bankruptcy / reorganization",
      "subcategory": "operational preservation measures during reorg"
    },
    {
      "id": "legal_034",
      "title": "Change of Guardian with Third-Party Supervision of Minor's Property",
      "problem": "When changing guardianship for a minor orphan, may the court—upon parties' consensus and after hearing the minor—appoint trusted third-party oversight of the minor's funds where the guardian's capacity or potential conflicts make direct management risky?",
      "prompt_tips": {
        "laws": [
          "PRC General Principles of Civil Law Art. 18, Art. 22 (older regime; cited in case)",
          "PRC General Provisions of Civil Law Art. 35",
          "(Context) PRC Civil Code guardianship chapter (successor framework)"
        ],
        "judgment_guidance": "If guardians are elderly/limited or conflicts exist regarding the ward's property, the court may, with party agreement and minor's views, recognize a trusted third person as property supervisor to safeguard the ward's assets; such supervisor holds no ownership and bears liability for infringements."
      },
      "expected_verdict": "Court changed the guardian to the grandparents and approved third-party (relative) custodial supervision over RMB 300,000 until age 18.",
      "difficulty": "easy",
      "category": "civil / special procedure",
      "subcategory": "guardianship change; property supervision"
    },
    {
      "id": "legal_035",
      "title": "Refusal to Enforce SIAC Award: Party Agreement on Three Arbitrators Overrides Fast-Track Sole Arbitrator",
      "problem": "Under the New York Convention, should a Chinese court refuse to enforce a foreign award where the arbitration proceeded under SIAC fast-track with a sole arbitrator despite a clause expressly requiring a three-member tribunal?",
      "prompt_tips": {
        "laws": [
          "CPL (PRC) Art. 283",
          "New York Convention Art. V(1)(d)"
        ],
        "judgment_guidance": "Party autonomy governs basic procedure like tribunal composition; unless contrary to mandatory lex arbitri, a clause requiring three arbitrators must prevail over institutional fast-track default to a sole arbitrator. Failure to honor it triggers Art. V(1)(d) and justifies non-recognition."
      },
      "expected_verdict": "Court refused recognition and enforcement of the SIAC award due to tribunal composition not conforming to the parties' agreement (three arbitrators).",
      "difficulty": "medium",
      "category": "civil / recognition & enforcement",
      "subcategory": "foreign arbitral award; tribunal composition"
    },
    {
      "id": "legal_036",
      "title": "Revocation of Guardian for Failure to Ensure Compulsory Education; Designation of Non-Relative Guardians",
      "problem": "Can a court revoke a biological parent's guardianship for long-term neglect resulting in the child's lack of household registration and inability to access compulsory education, and appoint third parties (non-grandparents/siblings) as guardians?",
      "prompt_tips": {
        "laws": [
          "PRC Civil Code Art. 27(2)",
          "PRC Civil Code Art. 36(1)(1)-(3)",
          "CPL (2017) Art. 134(1), Art. 178"
        ],
        "judgment_guidance": "Severe neglect impairing education constitutes serious infringement of the minor's lawful rights and meets grounds to revoke guardianship. Under the best-interests principle, courts may appoint willing third persons with stable capacity and close emotional ties as guardians, with village committee support."
      },
      "expected_verdict": "Court revoked the mother's guardianship and designated the long-term caretaking couple as the child's guardians.",
      "difficulty": "easy",
      "category": "civil / special procedure",
      "subcategory": "guardianship revocation & designation"
    },
    {
      "id": "legal_037",
      "title": "LLMC Fund for Coastal Domestic Voyage While in Ballast",
      "problem": "For a collision during an empty (in ballast) leg en route to load at a domestic port, may the shipowner invoke the lower Chinese limitation for vessels engaged in PRC port-to-port transport (50% of MSA Art. 210 baseline)?",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Arts. 204, 210, 213, 277",
          "SPC Provisions on Limitation Fund (2020) Arts. 20-21",
          "Ministry of Transport Rule on Limitation for <300 GT and Coastal Vessels (Art. 4)",
          "SPC Guiding Case No. 16 (interpretive context)"
        ],
        "judgment_guidance": "Determine voyage nature by the accident voyage: if evidence shows the next leg is domestic port-to-port and the casualty location aligns with that route, an in-ballast leg is part of the domestic transport; the 50% coastal limitation applies."
      },
      "expected_verdict": "Court granted the application and fixed the fund at 229,959 SDR-equivalent (50% of Art. 210 calculation) plus interest.",
      "difficulty": "medium",
      "category": "maritime / special procedure",
      "subcategory": "limitation of liability fund"
    },
    {
      "id": "legal_038",
      "title": "Shanghai Jiamian (Mask) Info Tech v. Yunrui, Youxing, Wolf Kill (Hainan), NetEase Leihuo — Pre-litigation Behavior Preservation for Unfair Competition",
      "problem": "Issue: During pending trademark-license disputes, direct competitors widely file platform complaints/warnings to force takedowns of the rival app ('Werewolves/狼人杀'). Does such conduct violate fair competition and justify a pre-litigation behavior preservation (injunction) to stop the complaints?",
      "prompt_tips": {
        "laws": [
          "PRC Civil Procedure Law (2017) Articles 100, 101, 108",
          "SPC Provisions on Behavior Preservation in IP Disputes Articles 5, 6, 7, 10, 11"
        ],
        "judgment_guidance": "Fair competition rights persist despite pending contract disputes. Large-scale complaints against a direct competitor on disputed facts during litigation, causing delisting/market exclusion, breach good faith and business ethics and constitute unfair competition; urgent behavior preservation may be granted to prevent irreparable harm."
      },
      "expected_verdict": "Pre-litigation injunction granted ordering the respondents to cease platform complaints (including warnings/takedown requests) until final judgment; reconsideration rejected and original injunction maintained.",
      "difficulty": "medium",
      "category": "civil / non-litigation procedure",
      "subcategory": "pre-litigation behavior preservation / unfair competition"
    }，
    {
      "id": "legal_039",
      "title": "Wujiang Jucheng Weaving Co. Execution-to-Bankruptcy Liquidation Transfer",
      "problem": "Issue: In an enforcement proceeding, the debtor enterprise (and its affiliate group) was unable to pay due debts and appeared asset-insufficient; when should the enforcement court transfer the case for bankruptcy review, how should execution and bankruptcy procedures be coordinated, and do the facts justify substantive consolidation of twenty affiliated companies and a unified distribution scheme? Guidance: Identify a \"bankruptcy cause\" under the Enterprise Bankruptcy Law (unable to pay due debts + asset insufficiency or manifest inability), then—upon consent of at least one applicant creditor or the debtor—order suspension of individual execution and transfer the file for bankruptcy review; adopt a workflow of \"execution follows bankruptcy; bankruptcy follows execution\" so that search/seizure/audit/compulsory measures in execution support administrator take-over after acceptance; apply substantive consolidation when personnel, business, assets, and finance are highly commingled such that assets and liabilities cannot be reasonably distinguished, thereby ensuring pari passu treatment of same-rank creditors and prioritized satisfaction of employee wage and tax claims.",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law of the PRC Article 1",
          "Enterprise Bankruptcy Law of the PRC Article 2(1)",
          "Enterprise Bankruptcy Law of the PRC Article 4",
          "Enterprise Bankruptcy Law of the PRC Article 120",
          "Company Law of the PRC (2013 amendment) Article 3(1)",
          "Company Law of the PRC (2013 amendment) Article 21(2)",
          "Company Law of the PRC (2013 amendment) Article 216(4)",
          "Interpretation of the Supreme People's Court on the Application of the Civil Procedure Law Article 513",
          "Civil Procedure Law of the PRC (2017 amendment) Article 154(1)(11)"
    ],
        "judgment_guidance": "If, during enforcement, a corporate debtor meets the bankruptcy cause in EBL art. 2(1), the enforcement court should—upon creditor or debtor consent under SPC CPL Interpretation art. 513—suspend individual execution and transfer for bankruptcy; where affiliates show pervasive commingling (personnel, business, assets, finance) making separation impracticable, the court may order substantive consolidation so all claims of the same rank share pro rata while giving statutory priorities to employee wages and taxes."
  },
       "expected_verdict": "Ruling: Enforcement cases were transferred for bankruptcy review with creditor consent; on 2017-04-11 the court accepted liquidation cases for five core companies; on 2017-07-31 it ordered substantive consolidation of twenty related companies into a single bankruptcy estate; on 2017-10-20 it declared the consolidated entities bankrupt; a property realization and distribution plan was approved (first distribution recognized on 2018-02-11, paying employee wage and tax claims in full and ordinary claims pro rata); as no further distributable funds remained, the court terminated the consolidated bankruptcy proceedings on 2018-06-29.",
       "difficulty": "hard",
       "category": "legal",
       "subcategory": "bankruptcy liquidation (execution-to-bankruptcy; substantive consolidation)"
  }
  ],
  "count": 38,
  "metadata": {
    "source": "data/legal_dataset.json",
    "format": "json",
    "dataset_type": "legal",
    "schema_note": "Each item includes an issue, tips (laws and judgment guidance), and an expected verdict. Output requirements should align with the expected verdict."
  }
}
