{
  "type": "list",
  "data": [
    {
      "id": "legal_001",
      "title": "Person A Theft and Fraud Case",
      "problem": "Issue: The defendant secretly used the victim's identity to obtain a loan (Ant Borrow) into the victim's account, then induced the victim to transfer the funds by concealing the truth and fabricating facts. Does this constitute fraud? Guidance: Distinguish amounts obtained by secret taking (theft) versus amounts obtained by later deception (fraud).",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2017 Amendment) Article 264",
          "PRC Criminal Law (2017 Amendment) Article 266",
          "PRC Criminal Procedure Law (2012 Amendment) Article 225(1)(i)"
        ],
        "judgment_guidance": "If loan application secretly misappropriated account usage/credit, evaluate as theft; amounts later induced by deception may be evaluated as fraud; amounts counted accordingly."
      },
      "expected_verdict": "First-instance: conviction for theft and fraud with combined punishment; second-instance: judgment upheld.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "theft and fraud"
    },
    {
      "id": "legal_002",
      "title": "Person B Credit Card Theft Case",
      "problem": "Issue: Binding another's bank card to one's own platform with acquired identity information without the owner's knowledge, and disposing of the funds, constitutes theft of a credit card function and thus theft?",
      "prompt_tips": {
        "laws": [
          "Interpretation on Handling Criminal Cases that Hinder Management of Credit Cards (Art. 5)",
          "PRC Criminal Law (2015 Amendment) Article 196(3)",
          "PRC Criminal Law (2015 Amendment) Article 264"
        ],
        "judgment_guidance": "Secret binding and direct disposition of account funds constitutes secret taking of credit card function; treat as theft."
      },
      "expected_verdict": "Convicted of theft; imprisonment 1 year 6 months, probation 1 year 6 months, and a fine.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "credit card theft"
    },
    {
      "id": "legal_003",
      "title": "Person C et al.: Organized Crime (Soft Violence, Loan Sharking)",
      "problem": "Issue: Engaging in organized unlawful acts (e.g., 'loan sharking') mainly using 'soft violence'—does this constitute an organized crime group?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 294",
          "Opinions on Handling 'Loan Sharking' Criminal Cases (relevant articles)",
          "Opinions on Handling 'Soft Violence' Criminal Cases (Art. 4)"
        ],
        "judgment_guidance": "If organizational features, economic power, behavioral features, and harmful impact are present, recognize as organized crime; multiple offenses punished together."
      },
      "expected_verdict": "First- and second-instance: convictions for organizing/leading/participating in organized crime; combined punishment; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "organized crime"
    },
    {
      "id": "legal_004",
      "title": "Person D et al.: Organized Crime (Equity Profit-Sharing Model)",
      "problem": "Issue: Recruiting members via equity profit-sharing and distributing criminal proceeds by 'shares', with stable size and clear leadership—does this meet organizational features of organized crime?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 294",
          "Guiding Opinions on Handling Criminal Cases of Underworld Forces (Art. 9)",
          "Opinions on 'Soft Violence' Criminal Cases (Art. 4)"
        ],
        "judgment_guidance": "Profit-sharing does not negate organizational nature; sustained multi-offense behavior supports organized crime and combined punishment."
      },
      "expected_verdict": "Second-instance: maintains combined punishment for organizing/leading organized crime.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "organized crime"
    },
    {
      "id": "legal_005",
      "title": "Person E: Computer System Damage vs Theft",
      "problem": "Issue: Intruding a game company's database to tamper with virtual data for profit—does it constitute the crime of damaging computer information systems or theft?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 264",
          "PRC Criminal Law (2011 Amendment) Article 286",
          "Relevant sentencing norms (leniency: voluntary surrender, probation)"
        ],
        "judgment_guidance": "Absent major system damage and with core harm being unlawful appropriation of virtual assets, theft evaluation is more appropriate."
      },
      "expected_verdict": "Convicted of theft; imprisonment 2 years, probation 2 years, and a fine.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "computer and virtual property"
    },
    {
      "id": "legal_006",
      "title": "Person F: Extortion Retrial Acquittal",
      "problem": "Issue: Demanding money conditioned on exposure of wrongdoing, where the actor is the victim and evidence fails to prove intent to illegally possess—does it constitute extortion?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2017 Amendment) Article 274"
        ],
        "judgment_guidance": "If unlawful possession intent cannot be proved and there is a rights-remedy context, do not convict for extortion."
      },
      "expected_verdict": "Retrial quashes original conviction; not guilty declared.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "extortion / acquittal"
    },
    {
      "id": "legal_007",
      "title": "Person G: Platform Settlement Loophole Fraud",
      "problem": "Issue: Knowing settlement loopholes, fabricating transactions and exploiting refund prepayment mechanisms to profit—constitutes fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 266"
        ],
        "judgment_guidance": "Continuous exploitation of system loopholes with fabricated transactions to obtain prepayments constitutes fraud."
      },
      "expected_verdict": "Convicted of fraud; imprisonment 3 years, probation 4 years, and a fine.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "online platform fraud"
    },
    {
      "id": "legal_008",
      "title": "Person H: Contract Fraud and Embezzlement (Revised on Appeal)",
      "problem": "Issue: Carrier, with intent to illegally possess, intercepts goods under a 'reasonable loss' clause and fabricates losses—contract fraud? Combined punishment with embezzlement?",
      "prompt_tips": {
        "laws": [
          "Relevant Supreme People's Court/Procuratorate interpretations (reference)",
          "Interpretation on Embezzlement/Bribery Cases (Art. 11(1))",
          "PRC Criminal Law Articles 224, 271, 12, 69"
        ],
        "judgment_guidance": "Fabricating reasonable loss to obtain owner's property constitutes contract fraud; combined punishment with embezzlement; consider leniency factors."
      },
      "expected_verdict": "Appeal: combined punishment for contract fraud and embezzlement; imprisonment 2 years 11 months and fine; maintains embezzlement part.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "contract fraud / embezzlement"
    },
    {
      "id": "legal_009",
      "title": "Person I: Infringement (Shares as Property Under Custody)",
      "problem": "Issue: Under certain conditions, do shares qualify as 'property under custody' for the crime of misappropriation/infringement?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 270"
        ],
        "judgment_guidance": "Shares can be property with disposability; unauthorized disposition under a custody relationship with intent to illegally possess constitutes misappropriation."
      },
      "expected_verdict": "First- and second-instance: convicted; imprisonment 3 years and fine; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "misappropriation of shares"
    },
    {
      "id": "legal_010",
      "title": "Person J: Linked Offenses (Illegal Mobile Charges) as Theft",
      "problem": "Issue: Secretly deducting fees via remote illegal control of mobile information systems—when forming a linked offense with illegal control of computer systems and theft, should punishment be for theft?",
      "prompt_tips": {
        "laws": [
          "Interpretation on Theft Cases (Art. 13)",
          "Interpretation by the NPC Standing Committee on Criminal Law Article 30",
          "PRC Criminal Law (2015 Amendment) Article 264"
        ],
        "judgment_guidance": "Where property acquisition is the primary legal interest harmed, impose punishment for the more serious offense; treat as theft."
      },
      "expected_verdict": "Convicted of theft; sentences from 7 to 15 years for different defendants; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "info-system deduction / theft"
    },
    {
      "id": "legal_011",
      "title": "Person K Theft Case (Vehicle in Marital Dispute)",
      "problem": "Issue: Unauthorized possession and use of an ex-spouse's car—does it constitute theft despite civil dispute background?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 264",
          "Theft Judicial Interpretation Art. 1 (reference)"
        ],
        "judgment_guidance": "Secret taking with intent to illegally possess and long-term refusal to return constitutes theft."
      },
      "expected_verdict": "First-instance: theft, 3 years and fine; retrial acquittal (final: not guilty).",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "theft (retrial acquittal)"
    },
    {
      "id": "legal_012",
      "title": "Person L & Person M: Environmental Pollution",
      "problem": "Issue: Illegally dumping solid waste causing ecological damage and high losses—does it constitute 'serious environmental pollution' with 'especially serious consequences' under Art. 338?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 338",
          "Solid Waste Pollution Prevention Law Article 22",
          "Interpretation on Environmental Pollution Criminal Cases Art. 3(5)",
          "Jiangsu Provincial Regulation on Solid Waste Prevention Art. 51(3)"
        ],
        "judgment_guidance": "Entering first-class protected areas with serious ecological risks and significant losses constitutes serious environmental pollution; heavier punishment."
      },
      "expected_verdict": "Convicted; 5y6m and 5y imprisonment with fines; upheld on appeal; related fraud handled separately.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "environmental pollution"
    },
    {
      "id": "legal_013",
      "title": "Person N Fraud Case (Acquittal on Appeal)",
      "problem": "Issue: Continuous business use of loans, no squander/high-risk investment, no absconding, active remediation—sufficient to negate intent to illegally possess and thus not fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Procedure Law (2012 Amendment) Article 195(3)",
          "PRC Criminal Procedure Law (2012 Amendment) Article 225(3)"
        ],
        "judgment_guidance": "Assess fund usage, repayment intent and ability, and post-event conduct; if illegal possession intent unproven, not fraud."
      },
      "expected_verdict": "Second-instance quashes original judgment; not guilty declared.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "fraud / acquittal"
    },
    {
      "id": "legal_014",
      "title": "Person O Theft (Platform Settlement Error Exploitation)",
      "problem": "Issue: Merchant knowingly exploiting platform settlement errors via self-buy/self-sell 'brush orders' to withdraw funds—legal characterization?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 264"
        ],
        "judgment_guidance": "Using system errors to secretly obtain platform funds infringes property interests; treat as theft."
      },
      "expected_verdict": "Convicted of theft; imprisonment 12 years, deprivation of political rights 2 years, and fine; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "platform vulnerability theft"
    },
    {
      "id": "legal_015",
      "title": "Person P: Rape, Extortion (Evidence-Based without Confession)",
      "problem": "Issue: Cases with weak objective evidence and no confession—how should courts decide?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Procedure Law Article 53"
        ],
        "judgment_guidance": "Adhere to evidence-based adjudication; confession is not legally necessary; if evidence chain reaches beyond reasonable doubt, conviction is permissible."
      },
      "expected_verdict": "Second-instance maintains death penalty and submits to SPC; SPC approves death sentence.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "evidence-based adjudication / death penalty approval"
    },
    {
      "id": "legal_016",
      "title": "Person Q et al.: Extortion, Robbery, Drug Trafficking, Intentional Injury (Criminal Group)",
      "problem": "Issue: Is 'doing evil and oppressing the people' a key distinction between a criminal group of malign influence and an ordinary criminal group?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 25",
          "Guiding Opinions on Handling Crimes of Malign Influence (Arts. 15, 4, 5)"
        ],
        "judgment_guidance": "Key factors: relatively stable membership, repeated offenses using violence or soft violence, and adverse social impact."
      },
      "expected_verdict": "Main offender: combined punishment for multiple crimes to 13 years 6 months and fine; others sentenced; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "criminal group of malign influence"
    },
    {
      "id": "legal_017",
      "title": "Person R Fraud Retrial Acquittal",
      "problem": "Issue: Is failure to repay due loans necessarily fraud?",
      "prompt_tips": {
        "laws": [
          "Key holdings in retrial procedure documents (reference)"
        ],
        "judgment_guidance": "Intent to illegally possess is key; civil breach should not be generalized as criminal fraud."
      },
      "expected_verdict": "Retrial: acquittal.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "fraud / retrial acquittal"
    },
    {
      "id": "legal_018",
      "title": "Person S Theft (Not Returning Found Phone)",
      "problem": "Issue: Phone lost in a crowded public place with owner unaware; finder keeps and does not return—does this constitute secret taking of property (theft)?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 270",
          "PRC Criminal Law Article 264"
        ],
        "judgment_guidance": "Property left the owner's actual control and actor has intent to illegally possess; meets theft elements."
      },
      "expected_verdict": "First-instance: theft, fine; appeal: judgment upheld.",
      "difficulty": "easy",
      "category": "legal",
      "subcategory": "found-and-not-returned / theft"
    },
    {
      "id": "legal_019",
      "title": "Person T et al.: Providing Bank Cards and POS for Fraud (Accomplice)",
      "problem": "Issue: Knowingly providing bank cards/POS machines for telecom fraud and helping transfer illicit funds—accomplice to fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 266",
          "PRC Criminal Law Article 177-1(1)",
          "Interpretation on Fraud Criminal Cases Art. 7"
        ],
        "judgment_guidance": "Providing tools and sharing proceeds show joint intent and assistance; treat as accomplice to fraud; may also violate credit card management."
      },
      "expected_verdict": "Main offenders: combined punishment up to 13 years 6 months and fines; others sentenced; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "telecom fraud accomplice / credit card management"
    },
    {
      "id": "legal_020",
      "title": "Person U Embezzlement/Misappropriation (Final Acquittal)",
      "problem": "Issue: For a majority shareholder transferring projects and funds among related companies, without proof of intent to illegally possess or illegal use, do crimes of embezzlement/misappropriation establish?",
      "prompt_tips": {
        "laws": [
          "SPC Interpretation on Criminal Procedure Law Article 389(2)"
        ],
        "judgment_guidance": "Absent intent to illegally possess or elements of illegal use, do not convict for embezzlement/misappropriation."
      },
      "expected_verdict": "Retrial: acquittal; prosecution appeal rejected; final acquittal maintained.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "embezzlement/misappropriation acquittal"
    },
    {
      "id": "legal_021",
      "title": "Person V: Fake Cancer Therapy Fraud",
      "problem": "Issue: With intent to illegally possess, setting up a scam to induce patients/families to accept fake treatment or buy drugs for money—legal characterization?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 266",
          "PRC Criminal Law Articles 25, 26, 27",
          "PRC Criminal Law Articles 52, 53, 54, 59 (related)"
        ],
        "judgment_guidance": "Fabricating facts to obtain property in huge amounts constitutes fraud; proceeds to be recovered by law."
      },
      "expected_verdict": "First-instance: fraud, 8 years and fine; upheld on appeal.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "medical scam / fraud"
    },
    {
      "id": "legal_022",
      "title": "Person W & Person X: Large-Scale Online 'Nude Chat' Fraud",
      "problem": "Issue: For mass online fraud with many victims across regions, how to determine total criminal amount in trial?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 266",
          "PRC Criminal Law Article 25(1)",
          "PRC Criminal Law Article 64"
        ],
        "judgment_guidance": "Comprehensively rely on payment platform flows, bank transaction details, and victim sample testimonies to determine the total amount."
      },
      "expected_verdict": "Main offenders: fraud, 11y6m and 12y6m with fines; upheld on appeal.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "mass online fraud"
    },
    {
      "id": "legal_023",
      "title": "'Bar Companion' Expensive Fraudulent Consumption",
      "problem": "Issue: Inducing exorbitant consumption through fake dating to obtain money—fraud?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law Article 266",
          "PRC Criminal Law Article 25(1)"
        ],
        "judgment_guidance": "Fabricating facts (relationship, prices) with intent to illegally possess and inducing excessive payments constitutes fraud."
      },
      "expected_verdict": "Convicted of fraud; imprisonment and fines (56 victims, total ~135,000 RMB); accessories handled leniently.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "consumer fraud"
    },
    {
      "id": "legal_024",
      "title": "Person Y: Robbery by Carrying Weapon during Snatch",
      "problem": "Issue: Carrying a weapon while snatching, even without using or brandishing it, poses immediate threat to personal safety—punish as robbery?",
      "prompt_tips": {
        "laws": [
          "PRC Criminal Law (2011 Amendment) Article 263",
          "SPC Interpretation on Robbery Cases Art. 6",
          "SPC & SPP Interpretation on Snatching Cases Art. 2(4)"
        ],
        "judgment_guidance": "Carrying a weapon during snatching implies potential violence; punish as robbery with heavier penalty."
      },
      "expected_verdict": "Robbery: main offender 4y6m and fine; plus snatching combined to 4y9m; accomplices sentenced accordingly.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "conversion to robbery"
    },
    {
      "id": "legal_025",
      "title": "S. Shipping Co. v. G. Logistics Holdings — Recognition of UK Court Judgments (Reciprocity Test)",
      "problem": "Issue: In an application to recognize UK High Court and Court of Appeal judgments arising from ship lease guarantee disputes, how should a Chinese court assess reciprocity under CPL Art. 289 where China and the UK have no relevant treaty and there is no prior UK case recognizing a PRC judgment? Further, does a UK court’s use of PRC judgments/civil rulings as evidence constitute 'recognition and enforcement' of PRC judgments? Guidance: Examine whether, under the foreign forum’s domestic law, PRC civil/commercial judgments are generally recognizable/enforceable (de jure reciprocity), and confirm that mere evidentiary reference to PRC decisions is not the same as recognition/enforcement; also screen for public policy, jurisdiction, punitive damages, and other refusal grounds.",
      "prompt_tips": {
        "laws": [
          "PRC Civil Procedure Law (2021 Amendment) Article 289"
        ],
        "judgment_guidance": "Reciprocity does not require a prior foreign case recognizing a PRC judgment; if, under the foreign state’s law, PRC civil/commercial judgments are recognizable/enforceable in principle, reciprocity may be found. A foreign court citing PRC judgments/rulings as evidence is not 'recognition and enforcement'. Absent violations of PRC basic principles, sovereignty/security, or public interest—and where jurisdiction was accepted by agreement and the debtor participated—recognition should be granted; contractual interest/fees for non-performance are not 'punitive damages' excluded from recognition."
      },
      "expected_verdict": "Court granted recognition of the UK High Court [2015] EWHC 718 (Comm) judgment and related orders (2015–2018), and the UK Court of Appeal [2016] EWCA Civ 982 judgment and related orders; ruling effective upon service.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "recognition & enforcement of foreign judgments"
    },
    {
      "id": "legal_026",
      "title": "Foreign Arbitral Award Non-Recognition for Non-Foreign-Related Dispute",
      "problem": "Issue: Two PRC legal-person companies agreed to submit disputes with no foreign element to a foreign arbitral institution (Korean Commercial Arbitration Board). Should a PRC court recognize the resulting foreign award under the New York Convention?",
      "prompt_tips": {
        "laws": [
          "New York Convention (1958) Art. II, Art. V(1)(a), Art. V(2)(b)",
          "PRC Civil Procedure Law (2012 Amendment)",
          "PRC Arbitration Law (2009 Amendment)",
          "SPC Opinions on the Application of the CPL (Art. 304)",
          "PRC Law on Foreign-Invested Enterprises (2000 Amendment) Arts. 2, 8"
        ],
        "judgment_guidance": "Where both parties are PRC legal persons and the legal relationship and subject matter are entirely domestic, an agreement to submit to foreign arbitration violates mandatory PRC law and is invalid; a foreign award rendered on that basis shall not be recognized under Art. V(1)(a) and/or V(2)(b) of the New York Convention."
      },
      "expected_verdict": "Application to recognize the KCAB award dismissed by the Beijing No. 2 Intermediate People’s Court.",
      "difficulty": "medium",
      "category": "civil / non-litigation procedure",
      "subcategory": "recognition & enforcement of foreign arbitral awards"
    },
    {
      "id": "legal_027",
      "title": "Minority Shareholder–Initiated Compulsory Liquidation Due to Conflict of Interest",
      "problem": "Issue: May a minority shareholder seek court-ordered (compulsory) liquidation where majority shareholders, who owe large damages to the company and refuse to pay, would control a self-liquidation and thus face a direct conflict of interest?",
      "prompt_tips": {
        "laws": [
          "PRC Company Law (2018 Amendment) Arts. 183, 20",
          "SPC Interpretation (II) on the Application of the Company Law (2014) Art. 7(2)(ii), Art. 7(2)(iii), Art. 7(3)"
        ],
        "judgment_guidance": "If majority shareholders bear substantial liabilities to the company and cannot propose effective measures or provide security to ensure a lawful and timely self-liquidation, the court should accept a minority shareholder’s application for compulsory liquidation by reference to Company Law Interpretation (II) Art. 7(2)(ii)(iii) and (3)."
      },
      "expected_verdict": "On appeal, the Shanghai High People’s Court revoked the non-acceptance and ordered the lower court to accept the compulsory liquidation application.",
      "difficulty": "medium",
      "category": "corporate / insolvency",
      "subcategory": "compulsory liquidation (acceptance standards)"
    },
    {
      "id": "legal_028",
      "title": "Jurisdiction to Recognize Foreign Arbitral Award Based on Principal Place of Business",
      "problem": "Issue: For an offshore company registered in the Marshall Islands but carrying on business in Shanghai, may a PRC maritime court assume jurisdiction to recognize and enforce a London maritime arbitration award under the New York Convention?",
      "prompt_tips": {
        "laws": [
          "PRC Special Maritime Procedure Law Art. 11",
          "SPC Interpretation on the Application of the CPL (2020) Art. 3",
          "New York Convention (1958)"
        ],
        "judgment_guidance": "If evidence shows the respondent conducts business or maintains an office at the court locale, the site may be deemed the respondent’s principal place of business (domicile) in China; the maritime court at that locale has jurisdiction to accept an application to recognize and enforce the foreign award."
      },
      "expected_verdict": "Jurisdiction objection rejected; on appeal, Shanghai High People’s Court affirmed the maritime court’s jurisdiction.",
      "difficulty": "medium",
      "category": "maritime / arbitration enforcement",
      "subcategory": "recognition & enforcement of foreign arbitral awards (jurisdiction)"
    },
    {
      "id": "legal_029",
      "title": "Appointment of Estate Administrator: Standing of Non-heir Caregivers",
      "problem": "Issue: May persons who had no legal duty to support the decedents but in fact provided substantial care be deemed 'interested parties' entitled to apply to court to designate an estate administrator when the heirship is unclear or contested?",
      "prompt_tips": {
        "laws": [
          "PRC Civil Code Art. 1127",
          "PRC Civil Code Art. 1131",
          "PRC Civil Code Art. 1145",
          "PRC Civil Code Art. 1146",
          "PRC Civil Code Art. 1147",
          "PRC Civil Code Art. 230"
        ],
        "judgment_guidance": "Individuals other than heirs who provided substantial support to the decedent may be allocated appropriate estate and thus have a legal interest in the estate; they qualify as 'interested parties' and may petition the court to designate an estate administrator when disputes exist over the administrator."
      },
      "expected_verdict": "Court designated the local Civil Affairs Bureau as estate administrator upon application by the non-heir caregivers.",
      "difficulty": "medium",
      "category": "civil / non-litigation procedure",
      "subcategory": "estate administrator designation"
    },
    {
      "id": "legal_030",
      "title": "1+5 Substantive Consolidation Reorganization of Parent and Five Subsidiaries",
      "problem": "Issue: When may courts order substantive consolidation of multiple affiliated companies for reorganization, and how should a consolidated plan address asset advantages, creditor recoveries, and equity adjustments?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Arts. 1, 2, 86(2)"
        ],
        "judgment_guidance": "Where affiliated entities display highly commingled corporate personality (management overlap, shared finance/personnel, intertwined operations, large intercompany debts/guarantees) and segregation costs are excessive, courts may order substantive consolidation; intra-group claims are eliminated and a unified estate is distributed under a single plan, which may flexibly use cash plus debt-to-equity swaps and pre-vote mechanisms."
      },
      "expected_verdict": "Intermediate court ordered substantive consolidation of six affiliated companies and later approved the consolidated reorganization plan.",
      "difficulty": "hard",
      "category": "bankruptcy / reorganization",
      "subcategory": "substantive consolidation"
    },
    {
      "id": "legal_031",
      "title": "Liquidation-to-Composition for an SME Using Pre-Vote Rules",
      "problem": "Issue: For an SME with salvage value, can the court guide a shift from liquidation to composition and adopt pre-vote rules so that pre-balloted creditor consent carries over after conversion?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Arts. 95, 96(1), 97, 98"
        ],
        "judgment_guidance": "Where the debtor has going-concern value and creditors broadly support composition, courts may solicit pre-votes (including rules that carry forward to the formal composition meeting if no substantive changes occur) and, after hearing, convert to composition, recognize the agreement, and terminate the composition procedure."
      },
      "expected_verdict": "Court approved conversion to composition, recognized the composition agreement per pre-vote rules, and terminated the composition procedure.",
      "difficulty": "medium",
      "category": "bankruptcy / composition",
      "subcategory": "conversion from liquidation; pre-vote mechanism"
    },
    {
      "id": "legal_032",
      "title": "Listed Company Reorganization Concurrent with Major Asset Restructuring",
      "problem": "Issue: How to coordinate internal corporate governance and external regulatory approval when a listed company’s reorganization proceeds in parallel with a CSRC-regulated major asset restructuring?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Art. 86(2)",
          "Company Law (PRC, 2013 rev.)",
          "Securities Law (PRC, 2014 rev.)",
          "Administrative Measures for Major Asset Restructuring of Listed Companies (2016)"
        ],
        "judgment_guidance": "Under administrator-managed reorganization, retain the board/shareholders’ meeting to pass M&A/major asset resolutions while the administrator prepares the plan; activate the SPC-CSRC consultation mechanism and reference expert advisory opinions; upon creditor and equity group approval, the court may approve the plan that embeds the restructuring."
      },
      "expected_verdict": "Court approved the reorganization plan of the listed company and terminated the reorganization after consulting CSRC via the SPC-CSRC mechanism.",
      "difficulty": "hard",
      "category": "bankruptcy / listed companies",
      "subcategory": "reorganization with concurrent major asset restructuring"
    },
    {
      "id": "legal_033",
      "title": "Substantive Consolidation with Court-Approved Investor Trial Production",
      "problem": "Issue: During reorganization of substantively consolidated affiliates, may the court permit an investor to fund and commence trial production before plan approval to preserve core licenses and value?",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law (PRC) Arts. 1, 2, 26, 86"
        ],
        "judgment_guidance": "If core licenses risk lapse, equipment risks depreciation, and funding is insufficient, the administrator may seek court leave for investor-funded trial production before plan approval; this preserves going-concern value, benefits creditors, and should proceed under court/administrator/creditor supervision."
      },
      "expected_verdict": "Court allowed investor trial production; later, creditor groups approved and the court sanctioned the reorganization plan and terminated the procedure.",
      "difficulty": "medium",
      "category": "bankruptcy / reorganization",
      "subcategory": "operational preservation measures during reorg"
    },
    {
      "id": "legal_034",
      "title": "Change of Guardian with Third-Party Supervision of Minor's Property",
      "problem": "When changing guardianship for a minor orphan, may the court—upon parties' consensus and after hearing the minor—appoint trusted third-party oversight of the minor's funds where the guardian's capacity or potential conflicts make direct management risky?",
      "prompt_tips": {
        "laws": [
          "PRC General Principles of Civil Law Art. 18, Art. 22 (older regime; cited in case)",
          "PRC General Provisions of Civil Law Art. 35",
          "(Context) PRC Civil Code guardianship chapter (successor framework)"
        ],
        "judgment_guidance": "If guardians are elderly/limited or conflicts exist regarding the ward's property, the court may, with party agreement and minor's views, recognize a trusted third person as property supervisor to safeguard the ward's assets; such supervisor holds no ownership and bears liability for infringements."
      },
      "expected_verdict": "Court changed the guardian to the grandparents and approved third-party (relative) custodial supervision over RMB 300,000 until age 18.",
      "difficulty": "easy",
      "category": "civil / special procedure",
      "subcategory": "guardianship change; property supervision"
    },
    {
      "id": "legal_035",
      "title": "Refusal to Enforce SIAC Award: Party Agreement on Three Arbitrators Overrides Fast-Track Sole Arbitrator",
      "problem": "Under the New York Convention, should a Chinese court refuse to enforce a foreign award where the arbitration proceeded under SIAC fast-track with a sole arbitrator despite a clause expressly requiring a three-member tribunal?",
      "prompt_tips": {
        "laws": [
          "CPL (PRC) Art. 283",
          "New York Convention Art. V(1)(d)"
        ],
        "judgment_guidance": "Party autonomy governs basic procedure like tribunal composition; unless contrary to mandatory lex arbitri, a clause requiring three arbitrators must prevail over institutional fast-track default to a sole arbitrator. Failure to honor it triggers Art. V(1)(d) and justifies non-recognition."
      },
      "expected_verdict": "Court refused recognition and enforcement of the SIAC award due to tribunal composition not conforming to the parties' agreement (three arbitrators).",
      "difficulty": "medium",
      "category": "civil / recognition & enforcement",
      "subcategory": "foreign arbitral award; tribunal composition"
    },
    {
      "id": "legal_036",
      "title": "Revocation of Guardian for Failure to Ensure Compulsory Education; Designation of Non-Relative Guardians",
      "problem": "Can a court revoke a biological parent's guardianship for long-term neglect resulting in the child's lack of household registration and inability to access compulsory education, and appoint third parties (non-grandparents/siblings) as guardians?",
      "prompt_tips": {
        "laws": [
          "PRC Civil Code Art. 27(2)",
          "PRC Civil Code Art. 36(1)(1)-(3)",
          "CPL (2017) Art. 134(1), Art. 178"
        ],
        "judgment_guidance": "Severe neglect impairing education constitutes serious infringement of the minor's lawful rights and meets grounds to revoke guardianship. Under the best-interests principle, courts may appoint willing third persons with stable capacity and close emotional ties as guardians, with village committee support."
      },
      "expected_verdict": "Court revoked the mother's guardianship and designated the long-term caretaking couple as the child's guardians.",
      "difficulty": "easy",
      "category": "civil / special procedure",
      "subcategory": "guardianship revocation & designation"
    },
    {
      "id": "legal_037",
      "title": "LLMC Fund for Coastal Domestic Voyage While in Ballast",
      "problem": "For a collision during an empty (in ballast) leg en route to load at a domestic port, may the shipowner invoke the lower Chinese limitation for vessels engaged in PRC port-to-port transport (50% of MSA Art. 210 baseline)?",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Arts. 204, 210, 213, 277",
          "SPC Provisions on Limitation Fund (2020) Arts. 20-21",
          "Ministry of Transport Rule on Limitation for <300 GT and Coastal Vessels (Art. 4)",
          "SPC Guiding Case No. 16 (interpretive context)"
        ],
        "judgment_guidance": "Determine voyage nature by the accident voyage: if evidence shows the next leg is domestic port-to-port and the casualty location aligns with that route, an in-ballast leg is part of the domestic transport; the 50% coastal limitation applies."
      },
      "expected_verdict": "Court granted the application and fixed the fund at 229,959 SDR-equivalent (50% of Art. 210 calculation) plus interest.",
      "difficulty": "medium",
      "category": "maritime / special procedure",
      "subcategory": "limitation of liability fund"
    },
    {
      "id": "legal_038",
      "title": "Shanghai Jiamian (Mask) Info Tech v. Yunrui, Youxing, Wolf Kill (Hainan), NetEase Leihuo — Pre-litigation Behavior Preservation for Unfair Competition",
      "problem": "Issue: During pending trademark-license disputes, direct competitors widely file platform complaints/warnings to force takedowns of the rival app ('Werewolves/狼人杀'). Does such conduct violate fair competition and justify a pre-litigation behavior preservation (injunction) to stop the complaints?",
      "prompt_tips": {
        "laws": [
          "PRC Civil Procedure Law (2017) Articles 100, 101, 108",
          "SPC Provisions on Behavior Preservation in IP Disputes Articles 5, 6, 7, 10, 11"
        ],
        "judgment_guidance": "Fair competition rights persist despite pending contract disputes. Large-scale complaints against a direct competitor on disputed facts during litigation, causing delisting/market exclusion, breach good faith and business ethics and constitute unfair competition; urgent behavior preservation may be granted to prevent irreparable harm."
      },
      "expected_verdict": "Pre-litigation injunction granted ordering the respondents to cease platform complaints (including warnings/takedown requests) until final judgment; reconsideration rejected and original injunction maintained.",
      "difficulty": "medium",
      "category": "civil / non-litigation procedure",
      "subcategory": "pre-litigation behavior preservation / unfair competition"
    },
    {
      "id": "legal_039",
      "title": "Wujiang Jucheng Weaving Co. Execution-to-Bankruptcy Liquidation Transfer",
      "problem": "Issue: In an enforcement proceeding, the debtor enterprise (and its affiliate group) was unable to pay due debts and appeared asset-insufficient; when should the enforcement court transfer the case for bankruptcy review, how should execution and bankruptcy procedures be coordinated, and do the facts justify substantive consolidation of twenty affiliated companies and a unified distribution scheme? Guidance: Identify a \"bankruptcy cause\" under the Enterprise Bankruptcy Law (unable to pay due debts + asset insufficiency or manifest inability), then—upon consent of at least one applicant creditor or the debtor—order suspension of individual execution and transfer the file for bankruptcy review; adopt a workflow of \"execution follows bankruptcy; bankruptcy follows execution\" so that search/seizure/audit/compulsory measures in execution support administrator take-over after acceptance; apply substantive consolidation when personnel, business, assets, and finance are highly commingled such that assets and liabilities cannot be reasonably distinguished, thereby ensuring pari passu treatment of same-rank creditors and prioritized satisfaction of employee wage and tax claims.",
      "prompt_tips": {
        "laws": [
          "Enterprise Bankruptcy Law of the PRC Article 1",
          "Enterprise Bankruptcy Law of the PRC Article 2(1)",
          "Enterprise Bankruptcy Law of the PRC Article 4",
          "Enterprise Bankruptcy Law of the PRC Article 120",
          "Company Law of the PRC (2013 amendment) Article 3(1)",
          "Company Law of the PRC (2013 amendment) Article 21(2)",
          "Company Law of the PRC (2013 amendment) Article 216(4)",
          "Interpretation of the Supreme People's Court on the Application of the Civil Procedure Law Article 513",
          "Civil Procedure Law of the PRC (2017 amendment) Article 154(1)(11)"
        ],
        "judgment_guidance": "If, during enforcement, a corporate debtor meets the bankruptcy cause in EBL art. 2(1), the enforcement court should—upon creditor or debtor consent under SPC CPL Interpretation art. 513—suspend individual execution and transfer for bankruptcy; where affiliates show pervasive commingling (personnel, business, assets, finance) making separation impracticable, the court may order substantive consolidation so all claims of the same rank share pro rata while giving statutory priorities to employee wages and taxes."
      },
      "expected_verdict": "Ruling: Enforcement cases were transferred for bankruptcy review with creditor consent; on 2017-04-11 the court accepted liquidation cases for five core companies; on 2017-07-31 it ordered substantive consolidation of twenty related companies into a single bankruptcy estate; on 2017-10-20 it declared the consolidated entities bankrupt; a property realization and distribution plan was approved (first distribution recognized on 2018-02-11, paying employee wage and tax claims in full and ordinary claims pro rata); as no further distributable funds remained, the court terminated the consolidated bankruptcy proceedings on 2018-06-29.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "bankruptcy liquidation (execution-to-bankruptcy; substantive consolidation)"
    },
    {
      "id": "legal_040",
      "title": "Applicant A (Minor) Application to Declare Mother Missing",
      "problem": "Issue: When a 'de facto unsupported child' applies to declare a parent missing, what procedural steps and evidentiary thresholds must the court satisfy before issuing a missing-person judgment? Guidance: After accepting the application, the court must issue a public notice to search for the person whose whereabouts are unknown for the statutory period (three months for missing; one year for death, or three months if death is certain due to an accident), conduct necessary investigations (household registration, police certificates, village committee attestations), and upon expiry, adjudicate based on whether the facts of prolonged disappearance are confirmed.",
      "prompt_tips": {
        "laws": [
          "General Provisions of the Civil Law of the PRC Article 40",
          "Civil Procedure Law of the PRC (2017 amendment) Article 185"
        ],
        "judgment_guidance": "If a parent has been continuously missing for at least two years and remains untraceable after a court-issued three-month public notice and necessary investigation, the court should render a judgment declaring the person missing so that the minor applicant can access corresponding relief and protections."
      },
      "expected_verdict": "First-instance (Xuzhou Tongshan District People's Court): After issuing a three-month notice on 2018-08-16 and verifying that the mother (Person B) had been missing since 2009 with no responses received, the court on 2018-12-24 rendered judgment declaring the mother missing.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "declaration of missing person (special procedure)"
    },
    {
      "id": "legal_041",
      "title": "Applicant A v. Yaoqiao Village Committee, Zhenjiang — Revocation of Guardian Qualification Dispute",
      "problem": "Issue: When a village committee designates an unfit relative as guardian of a minor, under what circumstances may the court revoke that guardian qualification and reassign guardianship to a public authority? Guidance: In assessing a guardian’s capacity, courts must consider health, economic means, willingness, and closeness of relationship with the ward. If all close relatives lack capacity or willingness to serve, the court may, in the child’s best interest, designate the local civil affairs department (or its subordinate welfare institution) as guardian to ensure proper care and upbringing.",
      "prompt_tips": {
        "laws": [
          "General Principles of the Civil Law of the PRC (2009 revision) Article 16",
          "Civil Procedure Law of the PRC (2012 revision) Article 178",
          "Civil Procedure Law of the PRC (2012 revision) Article 180",
          "Supreme People's Court Opinions on Implementing the General Principles of Civil Law (Trial) Articles 10–12, 14, 17, 19"
        ],
        "judgment_guidance": "If both parents and other close relatives lack guardianship capacity due to disability or poverty, and the designated guardian is unwilling or unable to fulfill duties, the court should revoke the designation and, in the ward’s best interest, appoint the local civil affairs authority as guardian through its welfare institution."
      },
      "expected_verdict": "First-instance (Zhenjiang Economic Development Zone People's Court): The court revoked the village committee's designation of the applicant as guardian of the infant (Minor B) and appointed the Zhenjiang Civil Affairs Bureau as the new guardian, to be implemented by the Zhenjiang Children's Welfare Institute. Judgment rendered on 2014-08-22.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "revocation of guardian qualification (special procedure)"
    },
    {
      "id": "legal_042",
      "title": "Hengmei Yarn Co. v. Shenzhen Bain & Company Soho International Freight Forwarding Co. — Maritime Cargo Transport Contract (Delivery without Original B/L & Foreign Law Ascertainment)",
      "problem": "Issue: When a carrier delivers cargo at a foreign port without the original bill of lading, may the carrier invoke an exemption under the law of the port of discharge where such law mandates delivery to local customs or port authorities? How should Chinese courts determine and apply 'law of the port of discharge' under the judicial interpretation on delivery without original B/L? Guidance: Distinguish between foreign substantive law applicable as the governing law of the contract (ascertained by the court under the PRC Law on Application of Law for Foreign-Related Civil Relations) and foreign law referenced as a defense ground after the governing law has been determined to be PRC law; when a carrier claims exemption under Art. 7 of the SPC Interpretation on Delivery without Original B/L Cases, the carrier bears the burden of proving both (1) that the law of the port of discharge mandates delivery to local customs/port authorities, and (2) that the cargo was actually delivered to such authorities.",
      "prompt_tips": {
        "laws": [
          "PRC Law on Application of Law for Foreign-Related Civil Relations Article 8",
          "PRC Law on Application of Law for Foreign-Related Civil Relations Article 10(1)",
          "PRC Maritime Code Article 269",
          "SPC Interpretation on Delivery without Original B/L Cases Article 3",
          "SPC Interpretation on Delivery without Original B/L Cases Article 7"
        ],
        "judgment_guidance": "After determining PRC law as the governing law, 'law of the port of discharge' under SPC Interpretation Art. 7 is a defense invoked by the carrier and does not constitute 'foreign law' under the Law on Application of Law Art. 10(1) that must be ascertained by the court; the burden of proving the existence and content of such foreign law lies with the party invoking it. The carrier must prove both the existence of mandatory delivery laws at the discharge port and actual delivery to local authorities to qualify for exemption."
      },
      "expected_verdict": "First-instance (Tianjin Maritime Court): Carrier liable for cargo-price loss USD 148,658.16 plus interest; Second-instance (Tianjin High People's Court): Appeal dismissed, original judgment affirmed.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "maritime transport / delivery without original B/L / foreign law burden of proof"
    },
    {
      "id": "legal_043",
      "title": "Jiangsu Jinma Shipping Group v. PICC Jingjiang Branch — Marine Insurance Contract (Vessel Overloading & Reference Cargo Capacity)",
      "problem": "Issue: In a marine cargo insurance contract that lists vessel overloading as an exclusion but does not define 'overloading,' may the insurer deny coverage solely on the ground that actual cargo weight exceeded the 'reference cargo capacity' recorded in the vessel's inspection certificate? What is the proper standard for determining vessel overloading? Guidance: The 'reference cargo capacity' in a vessel inspection certificate is an approximate design value for cargo with a certain stowage factor and serves only as a reference; it cannot be the sole basis for finding overloading. Overloading under maritime safety terminology means the vessel's actual total load (cargo, fuel, water, stores) exceeds the applicable loadline such that freeboard is insufficient and the vessel is unseaworthy. In the absence of a contractual definition, courts should apply the industry-standard loadline criterion; an insurer's claim for exemption based solely on cargo weight exceeding reference capacity should be rejected.",
      "prompt_tips": {
        "laws": [
          "PRC Insurance Law Article 14",
          "PRC Insurance Law Article 64",
          "Water Safety Supervision Terminology 3.1.27 (vessel overloading definition)"
        ],
        "judgment_guidance": "Reference cargo capacity is not a determinative overloading standard. Assess overloading by whether the vessel exceeded the applicable loadline (freeboard standard). Where the insurance contract does not define overloading, apply the recognized maritime safety standard. If evidence (including on-site loading tests) shows the vessel did not exceed loadlines, the insurer bears the burden of proving overloading and cannot rely solely on reference-capacity figures. Courts should also note an insurer's failure to investigate promptly after receiving notice of loss."
      },
      "expected_verdict": "First-instance (Nanjing Maritime Court): Insurer liable to pay RMB 117,540.80 to the vessel operator after applying value-proportionate sharing of salvage costs, under-insurance deduction, and franchise; judgment became final as neither party appealed.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "marine insurance / overloading criteria / insurer exemption"
    },
    {
      "id": "legal_044",
      "title": "Jiangsu Weilun Shipping v. Miranda Rose Ltd. — Vessel Collision Damages (Agreed Violation of COLREGs)",
      "problem": "Issue: When two vessels agree by radio to navigate in a manner contrary to the International Regulations for Preventing Collisions at Sea, 1972 (COLREGs) and subsequently collide, how should courts allocate fault? May either party rely solely on the other's breach of the agreement or solely on COLREGs duties to shift liability? Guidance: Neither vessel may invoke the violated agreement alone or COLREGs alone to aggravate the other's fault or reduce its own. Courts should apply COLREGs as the fundamental standard, consider the content of the parties' agreement, comprehensively analyze how the close-quarters situation arose and whether maneuvers were appropriate, and then assess fault. Where vessels consensually agree to 'green-to-green' passing (violating give-way obligations), both assume equal responsibility to navigate with special caution; subsequent failure by both to keep proper lookout and take timely collision-avoidance action results in equal fault.",
      "prompt_tips": {
        "laws": [
          "International Regulations for Preventing Collisions at Sea, 1972 (COLREGs)",
          "SPC Provisions on Adjudicating Vessel Collision Disputes"
        ],
        "judgment_guidance": "Agreed deviations from COLREGs do not create new legal 'give-way' and 'stand-on' duties; both vessels bear equal collision-avoidance responsibility. Courts must evaluate compliance with lookout, safe speed, and collision-avoidance rules under COLREGs and allocate liability based on each vessel's contribution to the casualty. In consensual violations, equal fault (50/50) is often appropriate when both fail in caution and timely action."
      },
      "expected_verdict": "First-instance (Shanghai Maritime Court): Both vessels equally at fault (50% each); Miranda Rose Ltd. liable for 50% of plaintiff's damages; judgment became final as neither party appealed.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "vessel collision / agreed deviation from navigation rules"
    },
    {
      "id": "legal_045",
      "title": "Junrong Underwear Co. v. CEVA Freight (Shenzhen) Co. — Marine Freight Forwarding Contract (FCR vs. Transport Contract & Forwarder Liability)",
      "problem": "Issue: Does a freight forwarder's cargo receipt (FCR) that contains shipping information but expressly states the forwarder acts 'as agent, not as carrier' constitute proof of a contract of carriage? What is the scope of a freight forwarder's duty and liability when the shipper requests the forwarder to stop delivery or return goods in transit? Guidance: A transport document other than a B/L can evidence a contract of carriage only if it embodies mutual intent to contract for carriage. An FCR bearing an express disclaimer of carrier status and issued in the context of a FOB sale (where the buyer arranges transport) is merely a cargo receipt, not proof of a carriage contract. A freight forwarder's obligations are defined by the freight forwarding contract; the forwarder is liable for breach only under a fault-presumption standard and may exonerate itself by proving it fulfilled agency duties without fault. Where the forwarder has no control over the goods and properly relays the shipper's instructions to the principal, it is not liable for the principal's ultimate delivery decision.",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Article 80(1)",
          "SPC Provisions on Marine Freight Forwarding Disputes Article 10"
        ],
        "judgment_guidance": "An FCR stating 'as freight forwarder, not as carrier' and issued in a FOB transaction does not create a contract of carriage with the shipper. The forwarder's duty is to exercise reasonable care in selecting third parties and relaying instructions; it is not liable for acts/omissions of the actual carrier or principal. Apply fault-presumption: if the forwarder proves it completed agreed services (e.g. port charges, document handling) and promptly communicated the shipper's stop-delivery request without fault, it bears no liability for cargo loss arising from the principal's delivery to the consignee."
      },
      "expected_verdict": "First-instance (Guangzhou Maritime Court): Forwarder liable for cargo loss; Second-instance (Guangdong High People's Court): Reversed; forwarder not liable as it acted without fault and had no duty or ability to control cargo under the freight forwarding contract.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "marine freight forwarding / FCR nature / forwarder fault-based liability"
    },
    {
      "id": "legal_046",
      "title": "Person A v. Person B, Zhejiang Haisheng Shipping Co. & Person C — Marine Aquaculture Damage Tort (Unlicensed Aquaculture & Conflicting Expert Opinions)",
      "problem": "Issue: When an unlicensed aquaculture operator's facilities are damaged by a vessel, may the operator recover for lost aquaculture income and damaged facilities? When multiple expert reports on the extent and quantity of damage diverge significantly, how should courts evaluate conflicting opinions? Guidance: An unlicensed aquaculture operator may not recover lost aquaculture profits (as the unlicensed activity itself is not legally protected), but may recover reasonable costs to repair or replace damaged facilities (as owner of the facilities). When expert reports conflict materially, courts may employ expert witness assistants and apply common-sense evaluation to assess the objectivity and reasonableness of each report, giving priority to court-appointed on-site assessments made promptly after the incident over later desktop analyses.",
      "prompt_tips": {
        "laws": [
          "PRC Tort Liability Law (former) Article 6(1)",
          "PRC Maritime Code Article 21",
          "PRC Maritime Code Article 22(1)(v)",
          "PRC Maritime Code Article 28",
          "PRC Maritime Code Article 29(1)(i)"
        ],
        "judgment_guidance": "Distinguish between unlawful aquaculture activity (income not recoverable) and ownership of damaged facilities (repair costs recoverable). Allocate fault between the vessel operator (primary fault for entering aquaculture area without proper navigation) and the aquaculture operator (secondary fault for lack of proper marking/lighting and unlicensed operation). When expert reports diverge—one based on immediate on-site measurement, another on later theoretical calculation—prefer the on-site assessment unless clear evidence shows it is unreliable. Apply comparative-fault reduction. Recognize maritime lien for aquaculture damage claims; if the vessel is arrested and then released on security, the lien converts to a claim against the security within the guaranteed amount."
      },
      "expected_verdict": "First-instance (Dalian Maritime Court): Vessel operator liable to pay RMB 384,602.40 plus interest (195 damaged rafts at 80% loss rate, applying 80/20 fault split); vessel owner liable within RMB 810,000 security amount; other claims dismissed. Second-instance (Liaoning High People's Court): Appeal dismissed, original judgment affirmed.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "marine aquaculture damage tort / unlicensed activity / conflicting expert reports"
    },
    {
      "id": "legal_047",
      "title": "Person A v. Person B & Person C — Marine Personal Injury Tort (Employer Liability & 'Forum Court Location' for Disability Compensation)",
      "problem": "Issue: When an employee is injured during commercial fishing operations under an employment relationship between individuals, must the employer prove fault to be liable, or does strict liability apply? When calculating disability compensation under the SPC Interpretation on Personal Injury Compensation, does 'location of the forum court' refer to the location of a branch tribunal or to the institutional seat of the court itself? Guidance: Individual employment relationships arising from commercial and profit-making activities (as opposed to household services) are governed by strict employer liability under the SPC Personal Injury Interpretation Art. 11; the employer is liable regardless of fault. 'Forum court location' in Art. 25 refers to the institutional seat of the court that accepted the case, not to any branch tribunal that may hear it; for specialized courts with multi-provincial jurisdiction, use the statistical data of the municipality where the court's headquarters is located (e.g., a separately planned municipality).",
      "prompt_tips": {
        "laws": [
          "PRC Tort Liability Law (former) Article 35",
          "SPC Interpretation on Personal Injury Compensation Cases Article 11",
          "SPC Interpretation on Personal Injury Compensation Cases Article 25",
          "SPC Interpretation on Personal Injury Compensation Cases Article 35"
        ],
        "judgment_guidance": "Distinguish personal-service employment (housekeeping, nannies—fault-based under Tort Liability Law Art. 35) from commercial employment (fishing, business operations—strict liability under SPC Interpretation Art. 11). The employer in a commercial fishing employment relationship bears no-fault liability for crew injuries during employment activities unless the employee has intent or gross negligence. For disability compensation, identify the 'forum court' as the court institution (not its branch tribunal); if the court sits in a separately planned municipality, apply that municipality's per-capita disposable income statistics. Calculate compensation according to disability grade, local income standard, and duration as prescribed."
      },
      "expected_verdict": "First-instance (Dalian Maritime Court): Employer liable for RMB 126,525.81 in total damages (disability, lost wages, medical expenses, minus RMB 34,600 advance payment). Second-instance (Liaoning High People's Court): Partially modified; disability compensation increased to RMB 344,719.20 (based on Dalian municipal standard as the court's institutional seat), nursing care, nutrition, moral damages, and subsistence allowances adjusted; other claims dismissed.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "marine personal injury / employer strict liability / forum-court location standard"
    },
    {
      "id": "legal_048",
      "title": "Person A v. Person B & Shengsi Jiangshan Shipping Co. — Vessel Collision Damages (Loss of Right to Limit Maritime Liability for Serious Repeated Violations)",
      "problem": "Issue: When a vessel has engaged in long-term, repeated serious violations of navigation laws (including sailing beyond permitted zones, sailing without port clearances, unlicensed crew, and insufficient manning) and then flees the collision scene, has the shipowner forfeited the right to limit maritime liability under the Maritime Code? What standard should courts apply to determine whether a responsible party acted with intent or 'recklessly with knowledge that damage would probably result'? Guidance: The right to limit maritime liability is lost when the responsible party (owner/operator) personally acted with intent or recklessly with knowledge that loss would probably result. Long-term, repeated serious violations (ultra vires navigation, no clearances, unlicensed operation, undermanning) combined with fleeing after collision demonstrate that the responsible party knew such conduct would likely cause loss yet continued to act or omit action recklessly. Such conduct constitutes grounds for forfeiture of limitation rights under Maritime Code Art. 209 and SPC Maritime Limitation Provisions Art. 19.",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Article 166",
          "PRC Maritime Code Article 209",
          "PRC Maritime Traffic Safety Law Articles 4, 5, 6, 34, 37",
          "International Regulations for Preventing Collisions at Sea (COLREGs) Rules 5, 6, 19, 35",
          "SPC Provisions on Maritime Limitation Disputes Article 19"
        ],
        "judgment_guidance": "Assess whether the shipowner/operator personally (not merely crew) knew or should have known that serious violations (ultra vires sailing, no port clearances, unlicensed/insufficient crew) create substantial risk of collision and loss. Evidence of long-term, systematic violations (not isolated incidents) and corporate acquiescence (operator's safety notices admitting widespread violations) supports a finding of reckless conduct. Post-collision flight without rescue or reporting, when the owner was informed and failed to order proper response, further demonstrates reckless disregard. Apply comparative fault principles to allocate collision liability between vessels; the violating vessel bears primary (e.g., 70%) liability. Both owner and registered operator are jointly liable without limitation when forfeiture is established."
      },
      "expected_verdict": "First-instance (Shanghai Maritime Court): Person B (vessel owner) liable to pay Person A RMB 3,332,948.80 plus interest without limitation of liability; Jiangshan Shipping Co. (registered operator) jointly liable; counterclaim dismissed. Second-instance (Shanghai High People's Court): Appeal dismissed, original judgment affirmed.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "vessel collision / forfeiture of maritime limitation / serious repeated violations"
    },
    {
      "id": "legal_049",
      "title": "Minsheng Financial Leasing Co. v. Zhejiang Honglin Marine Engineering Co., Person A & Person B — Vessel Finance Lease Contract (Post-Termination Use Fees & Setoff Order)",
      "problem": "Issue: When a finance lease contract is terminated due to lessee's default and the vessel's market value has drastically depreciated, may the lessor claim use fees for the period the lessee continues to occupy the vessel after termination without resorting to appraisal and auction? How should courts calculate such use fees? What is the proper order of setoff when the lessee has paid deposits, advance rent, and partial rent? Guidance: Under Contract Law Arts. 97 and 248, upon termination for lessee's material breach, the lessor may reclaim the leased vessel and claim damages for continued unlawful occupation. To avoid forced appraisal/auction in a depressed market with severe vessel depreciation, courts may allow the lessor to claim use fees at the contractual rental rate from termination until actual return. Apply the contractual setoff sequence (fees → penalties → damages → rent → purchase price) and the fairness principle to determine which payments offset which obligations.",
      "prompt_tips": {
        "laws": [
          "PRC Contract Law Article 8",
          "PRC Contract Law Article 93",
          "PRC Contract Law Article 97",
          "PRC Contract Law Article 107",
          "PRC Contract Law Article 248",
          "PRC Security Law Article 18(1)",
          "PRC Security Law Article 31"
        ],
        "judgment_guidance": "When the lessee fails to pay rent for multiple consecutive periods (constituting material breach), the lessor may terminate the lease and reclaim the vessel. Post-termination use fees for continued occupation should be calculated at the pre-termination rental rate to promote prompt return and fairness, but without additional penalty interest (as the lease relationship has ended). Apply contractual setoff order: (1) fees, (2) penalties, (3) damages, (4) rent, (5) purchase price. Deposits converted to advance rent and partial payments should offset arrears in reverse chronological order (most recent periods first) unless contract specifies otherwise. Asset management fees agreed in supplemental contracts are enforceable if within the scope of the finance lease transaction. Penalty clauses at 0.05% per day are reasonable in the finance lease context when benchmarked against financial-sector penalty interest norms. Guarantors remain jointly liable for all obligations including post-termination use fees."
      },
      "expected_verdict": "First-instance (Tianjin Maritime Court): Finance lease contract terminated as of 2013-11-21; lessee to return vessel and pay RMB 17,011,342.69 in arrears rent, corresponding penalties (0.05% per day on each period's principal from due date), RMB 938,312.94 in asset management fees and penalties, and post-termination use fees at RMB 3,809,130.93 per period until return; Person A and Person B jointly liable as guarantors; judgment became final as no party appealed.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "vessel finance lease / post-termination use fees / setoff order / penalty adjustment"
    },
    {
      "id": "legal_050",
      "title": "Fidelidade Insurance (Portugal) v. Starr Property Insurance Co. — Marine Insurance Contract (Duplicate Insurance Contribution & Subrogation Independence)",
      "problem": "Issue: When duplicate marine insurance exists over the same cargo and one insurer pays the full claim, under what conditions may that first-paying insurer claim contribution from the co-insurer? Must the first-paying insurer exhaust subrogation remedies against the carrier before claiming contribution from the co-insurer? May the co-insurer refuse contribution on the ground that the insured failed to provide claim documents or that subrogation rights were not pursued? Guidance: Under Maritime Code Art. 225, duplicate-insurance contribution requires: (1) the first payment was reasonable and prudent, (2) the co-insurer also bears liability to the insured under its policy, and (3) the first payment exceeds the first insurer's proportionate share. Contribution does not require prior subrogation against third-party tortfeasors; the co-insurer may not refuse contribution merely because the first insurer has not sued the carrier. The co-insurer may raise defenses available against the insured, but refusal to pay the insured (based on document non-submission) does not defeat contribution when the first insurer's payment was valid and discharged the co-insurer's liability.",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Article 225",
          "PRC Law on Application of Law for Foreign-Related Civil Relations Article 3"
        ],
        "judgment_guidance": "Duplicate insurance exists when multiple policies cover the same insured, same subject matter, same insurable interest, and same risk during the same voyage. In a duplicate-insurance contribution claim, assess: (1) Was the first payment reasonable/prudent (supported by survey/adjustment)? (2) Does the co-insurer bear liability under its policy for the same loss? (3) Did the first payment discharge the co-insurer's liability and exceed the first insurer's proportionate share? The first insurer's subrogation right against third parties (e.g., carrier) is independent of and does not precede the contribution right against the co-insurer; lack of subrogation action is not a valid defense. The co-insurer cannot invoke the insured's breach of cooperation duties (failure to provide documents to the co-insurer) to defeat contribution, as that conflicts with the insured's statutory freedom to claim from any insurer. Survey/adjustment fees are the first insurer's normal operating costs (covered by premium), not subject to contribution absent special agreement."
      },
      "expected_verdict": "First-instance (Shanghai Maritime Court): Co-insurer liable to pay first insurer EUR 21,486.61 (50% of claim payment) plus interest; claim for contribution of survey fees dismissed; judgment became final as both parties accepted and defendant voluntarily performed.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "marine insurance / duplicate insurance contribution / subrogation independence"
    },
    {
      "id": "legal_051",
      "title": "Xiamen C&D Commodities Co. v. Hua Xing Hai Shipping Co. — Marine Cargo Transport Contract (Bulk Cargo Reasonable Shortage & Separate Calculation for Multiple B/Ls)",
      "problem": "Issue: In bulk cargo transport measured by draft survey, what amount of shortage qualifies as 'reasonable' within which the carrier may be exempted from liability? When multiple bills of lading for the same voyage involve mixed loading and split discharge, should the 5‰ reasonable-shortage threshold be calculated separately for each B/L or collectively for the entire shipment? May a carrier invoke the 5‰ rule based on total vessel cargo to exempt liability for shortage exceeding 5‰ under a particular B/L when the consignee is the same party? Guidance: Under maritime practice and custom, shortage within 5‰ for bulk cargo measured by draft survey is deemed reasonable (reflecting natural loss, spillage, and measurement tolerance) and the carrier is exempt unless evidence shows non-excusable fault. Even when multiple B/Ls consign to the same party and cargo is mixed, each B/L represents an independent legal relationship; reasonable shortage must be calculated separately per B/L, not by aggregating all B/Ls. A carrier cannot use 'total vessel shortage ≤5‰' to avoid liability for a B/L whose individual shortage exceeds 5‰.",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Article 46(1)",
          "PRC Maritime Code Article 55(1)(2)",
          "PRC Maritime Code Article 71",
          "PRC Maritime Code Article 77",
          "PRC Maritime Code Article 269",
          "National Courts Foreign-Related Commercial & Maritime Trial Symposium Minutes (on bulk cargo shortage liability)"
        ],
        "judgment_guidance": "Carrier liability period for non-containerized cargo runs from loading to discharge (Art. 46). A clean B/L is prima facie evidence the carrier received goods as stated; carrier must deliver that quantity or be liable (Art. 77). For bulk cargo measured by draft survey, apply industry standard: shortage ≤5‰ is reasonable (due to natural loss, spillage, measurement error per China Inspection Standards for Draft Survey) and carrier is exempt unless consignee proves carrier fault. Shortage >5‰ is unreasonable; carrier is liable for the entire shortage unless carrier proves part is due to reasonable causes. When multiple B/Ls are issued for mixed cargo, calculate the 5‰ threshold separately for each B/L (each B/L is an independent contract); do not aggregate. Only the lawful B/L holder/consignee may claim for shortage under that B/L. Calculate loss at CFR unit price stated in the sales contract/invoice; reject separate currency-conversion loss claims (commercial risk). Interest runs from discharge completion at USD deposit rate."
      },
      "expected_verdict": "First-instance (Nanjing Maritime Court): Carrier exempt from liability for B/L No.1 shortage of 18.05 MT (0.5‰, within reasonable range); carrier liable for B/L No.2 shortage of 85.701 MT (8.7‰, exceeding reasonable range) at USD 17,483 plus USD interest from discharge date at China Bank USD deposit rate; plaintiff's claims for B/L Nos. 3&4 and currency loss dismissed; judgment became final as no appeal filed.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "marine cargo transport / bulk cargo reasonable shortage / multiple B/L separate calculation"
    },
    {
      "id": "legal_052",
      "title": "Global Eminence Ltd. v. CPIC Property & Casualty Co. — Marine Insurance Contract (Unseaworthiness Due to ISM Rule Violation & Safety Management System Deficiency)",
      "problem": "Issue: Does a vessel's violation of the International Safety Management Code (ISM Code) in its safety management system constitute unseaworthiness that exempts the insurer from liability for total loss? When an insured vessel suffers main engine failure leading to drifting and grounding, and evidence shows the shipowner lacked proper shore-based support and failed to implement the ISM-mandated safety management system, may the insurer deny coverage on unseaworthiness grounds even though the vessel held valid certificates (SMC and DOC)? Guidance: The ISM Code is a mandatory international standard under SOLAS; holding an SMC certificate is only prima facie evidence of compliance. If actual management deviates from the certified system—e.g., the registered manager never participates and the unqualified owner directly operates the vessel without providing adequate shore support, spare parts, or emergency response—the vessel is unseaworthy in its safety management system. When such management-system unseaworthiness directly causes or contributes to total loss (main engine failure escalating to grounding due to lack of shore support and delayed salvage), and the shipowner had actual knowledge, the insurer is exempt under Maritime Code Art. 244.",
      "prompt_tips": {
        "laws": [
          "PRC Maritime Code Article 244(1)(i)",
          "International Safety Management Code (ISM Code, part of SOLAS Convention)",
          "Institute Time Clauses – Hulls (Total Loss Only) 1/10/83"
        ],
        "judgment_guidance": "Unseaworthiness has technical and management dimensions. Technical: vessel condition (hull, machinery, equipment) fit for the voyage. Management: effective safety management system per ISM Code. Even with valid certificates, if the vessel's actual operation shows: (1) the certified ship manager never participates, (2) the unqualified owner directly manages without ISM resources/procedures, (3) inadequate spare parts for an aging vessel, (4) failure to provide shore support when main engine fails, (5) delayed salvage despite imminent grounding risk—the vessel is unseaworthy in safety management. Assess whether the total loss (grounding) resulted from the combined effect of technical unseaworthiness (insufficient spares, no post-repair verification) and management unseaworthiness (lack of emergency response per ISM). If the shipowner had actual knowledge (direct operation, aware of spare shortage, ignored captain's warnings, delayed tug arrangement), apply Maritime Code Art. 244: insurer not liable. Distinguish 'perils of the seas' (fortuitous marine accidents) from inevitable consequences of owner's lack of due diligence."
      },
      "expected_verdict": "First-instance (Shanghai Maritime Court): Insurer not liable; all claims dismissed. Second-instance (Shanghai High People's Court): Appeal dismissed, original judgment affirmed; vessel was unseaworthy both technically (main engine condition, insufficient spares) and in safety management (ISM non-compliance, no effective shore support); shipowner had actual knowledge; grounding was not a fortuitous 'peril of the seas' but result of owner's lack of due diligence.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "marine insurance / vessel unseaworthiness / ISM Code compliance / safety management system"
    },
    {
      "id": "legal_053",
      "title": "Wuxi Dahua Garment Co. v. Damco Global Logistics (Shanghai) Co. — Marine Freight Forwarding Contract (Forwarder's Duty to Deliver Transport Documents & Actual Shipper's Waiver in FOB Trade)",
      "problem": "Issue: In FOB trade where the freight forwarder issues a Forwarder's Certificate of Receipt (FCR) instead of a bill of lading (B/L), may the actual shipper claim damages from the forwarder for failing to deliver a B/L when the shipper repeatedly accepted FCRs without objection, used FCRs for L/C negotiation, and never requested a B/L? Does the forwarder's failure to deliver transport documents cause the shipper's loss of payment when the carrier issued a non-negotiable sea waybill (not a B/L)? Guidance: Assess whether the forwarder was at fault for not delivering documents by examining the shipper's conduct: if the shipper's actual behavior (accepting FCRs without protest, using FCRs to negotiate L/C, forming a course of dealing of not requesting B/Ls) demonstrates waiver of the right to demand B/Ls, the forwarder is not liable. Additionally, assess causation: if the carrier issued a non-negotiable sea waybill (not a document of title), delivering that waybill to the shipper would not enable cargo control; thus no causal link exists between non-delivery and the shipper's payment loss.",
      "prompt_tips": {
        "laws": [
          "SPC Provisions on Marine Freight Forwarding Disputes Article 8"
        ],
        "judgment_guidance": "In FOB transactions, the buyer typically arranges transport; the freight forwarder acts for the buyer, not the actual shipper (seller). When the actual shipper engages the forwarder only for ancillary services (inland transport, customs declaration) and the forwarder issues FCRs (non-negotiable cargo receipts), examine: (1) Did the shipper request a B/L from the forwarder or carrier? (2) Did the shipper accept FCRs repeatedly without objection, even using them for L/C negotiation? (3) Did the forwarder notify the shipper of FCR limitations (non-title document)? If the shipper's conduct shows implied waiver, the forwarder has no duty to deliver a B/L that was never issued. On causation: a non-negotiable sea waybill is not a document of title; even if delivered to the shipper, it would not prevent the consignee from taking delivery. Thus the forwarder's non-delivery does not cause the shipper's inability to control cargo or payment loss—the loss stems from trade contract risks (L/C non-payment, buyer default). Forwarder not liable absent fault and causation."
      },
      "expected_verdict": "First-instance (Shanghai Maritime Court): Forwarder not liable; all claims dismissed; shipper failed to request B/L and repeatedly accepted FCRs, demonstrating waiver; carrier issued non-negotiable sea waybill, not B/L, so delivery of that document would not enable cargo control; no fault and no causation. Second-instance (Shanghai High People's Court): Appeal dismissed, original judgment affirmed.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "marine freight forwarding / FCR vs B/L / actual shipper's document request duty / waiver by conduct"
    },
    {
      "id": "legal_054",
      "title": "Person A v. Royal Caribbean Cruises Ltd. (China) — Marine Personal Injury (Reasonable Limits of Safety Duty in Cruise Entertainment Facilities)",
      "problem": "Issue: When an 82-year-old cruise passenger trips over a threshold barrier entering a bumper-car entertainment area and suffers femoral neck fracture, to what extent is the cruise operator liable under its duty to provide a safe environment? What constitutes the 'reasonable limits' of a public entertainment venue operator's safety duty? How should courts allocate liability when the injured party is elderly and accompanied by adult family members who failed to provide adequate care? Guidance: Public entertainment venue operators owe a safety duty within reasonable limits, assessed by three principles: (1) Industry/common-sense standard—comply with applicable safety codes or, absent specific standards, meet risks foreseeable to a diligent manager or ordinary person; (2) General safety assurance—provide safety measures necessary and objectively feasible given current operational capacity, not unlimited protection for all consumer demands; (3) Self-protection principle—participants and their guardians bear their own duty of care for normally foreseeable risks. When a barrier (20cm high threshold) meets height standards but lacks complete warning markings (only partial yellow-black stripes, not on all surfaces), the operator has some fault; but when an elderly participant focused on the attraction rather than watching his step and adult companions failed to assist or remind, comparative fault applies heavily against the participant.",
      "prompt_tips": {
        "laws": [
          "PRC Tort Liability Law (former) Article 26",
          "PRC Tort Liability Law (former) Article 37",
          "SPC Interpretation on Personal Injury Compensation Cases Article 6"
        ],
        "judgment_guidance": "Operators of entertainment venues owe a duty of safety within reasonable limits, not absolute safety. Assess three factors: (1) Did the facility meet industry standards or common-sense safety expectations? A 20cm threshold for bumper-car containment is reasonable in height; incomplete warning markings (missing on metal attachment strip) show some negligence. (2) Did the operator provide general safety assurance feasible under current conditions? Requiring staff to individually remind and assist every elderly visitor exceeds reasonable expectations and operational capacity. (3) Did the participant and companions exercise self-protection? An elderly person choosing to participate in an activity bears responsibility to assess his own capability; adult family members accompanying an elderly parent owe a duty to remind and assist; inattention by both (participant focused on cars, not footing; companions not assisting) is the primary cause. Apply comparative fault: operator's partial lack of warning ≈ 20%; participant and companions' inattention ≈ 80%. Humanitarian compensation beyond legal liability is permissible by agreement."
      },
      "expected_verdict": "First-instance (Shanghai Maritime Court): Cruise operator liable for 50% of RMB 248,774.20 damages = RMB 78,827.15 (after deducting advance payments). Second-instance (Shanghai High People's Court): Modified liability to 20/80 split; operator liable for RMB 4,194.89 (after deducting advances) plus voluntary humanitarian compensation of RMB 74,632.26 (totaling first-instance amount); judgment final.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "marine personal injury / cruise operator safety duty / reasonable limits / comparative fault"
    },
    {
      "id": "legal_055",
      "title": "BETA S.A. v. Tianjin Luye Steel Trade Co. — International Sale of Goods (CISG Application, Contract Interpretation & Notice of Avoidance)",
      "problem": "Issue: When both parties to an international steel sale are located in CISG Contracting States, how should courts apply the CISG alongside domestic law? Under CISG Art. 8, how should courts interpret a supplemental agreement that increases contract price but states 'all original contract terms remain unchanged'—does the prepayment obligation (30% of contract price) also increase? Under CISG Art. 27, does a buyer's notice declaring the contract avoided become effective upon dispatch or upon receipt by the seller? Guidance: When CISG applies but does not regulate a matter (e.g., liquidated damages), apply domestic law chosen by the parties per conflict rules. For contract interpretation, apply CISG Art. 8: if parties' subjective intent is disputed, use the objective 'reasonable person' standard considering text, context, commercial reasonableness, and subsequent conduct. When a supplemental agreement increases total price but explicitly confirms the original prepayment amount was paid and states 'all original terms unchanged,' and does not expressly require additional prepayment on the price increase, a reasonable person would not understand the prepayment to automatically increase. On notice effectiveness: CISG Art. 27 adopts dispatch (not receipt) as the general rule for Part III notices unless otherwise specified; since Art. 26 (avoidance notice) does not specify receipt, avoidance is effective upon dispatch.",
      "prompt_tips": {
        "laws": [
          "UN Convention on Contracts for the International Sale of Goods (CISG) Articles 1(1)(a), 7(2), 8, 25, 26, 27, 47(1), 49(1), 63, 64(1), 81",
          "PRC Contract Law Articles 114(1)(2)",
          "PRC Law on Application of Law for Foreign-Related Civil Relations Article 41"
        ],
        "judgment_guidance": "Apply CISG when both parties' places of business are in Contracting States (Art. 1(1)(a)). For matters CISG does not settle and cannot be settled by CISG general principles (Art. 7(2)), apply domestic law under conflict rules; if parties choose PRC law, apply it for matters like liquidated damages. For contract interpretation under CISG Art. 8: (1) Subjective standard (Art. 8(1))—if other party knew or could not be unaware of intent; (2) Objective standard (Art. 8(2))—what a reasonable person of same kind would understand, considering Art. 8(3) circumstances including negotiations, practices, subsequent conduct. Here, supplemental agreement's text ('all original terms unchanged' + confirmation original prepayment paid + no express new prepayment clause) + context + commercial reasonableness + seller's subsequent silence on prepayment → reasonable interpretation: no additional prepayment required. On fundamental breach (Art. 25): buyer's delay in paying prepayment is not fundamental absent seller's Nachfrist (Art. 63/64) and absent proof of substantial detriment; seller's non-delivery after buyer's Nachfrist (Art. 47) expires is fundamental breach. Buyer may avoid contract per Art. 49(1)(b). Notice of avoidance (Art. 26) is effective upon dispatch per Art. 27 (general dispatch rule for Part III unless specified otherwise). Court may declare contract avoided as of notice dispatch date. For liquidated damages (not in CISG), apply PRC Contract Law Art. 114; adjust if excessive."
      },
      "expected_verdict": "First-instance (Tianjin No.1 Intermediate Court): Seller to return prepayment RMB 1,374,165 and pay liquidated damages (adjusted to 24% per annum from Nov. 1, 2017); other claims dismissed; correct result but flawed reasoning (applied PRC law directly without addressing CISG priority). Second-instance (Tianjin High People's Court): (1) Affirmed return of prepayment and damages; (2) Added declaration: contract avoided as of Nov. 8, 2017 (buyer's notice dispatch date); (3) Corrected legal reasoning: CISG applies primarily, PRC law supplementarily for matters CISG does not cover; judgment final.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "international sale of goods / CISG application / contract interpretation / avoidance notice effectiveness"
    },
    {
      "id": "legal_056",
      "title": "BY.O v. Yushang Group Co. — Service Contract Dispute (Validity of 'Arbitration-First-Then-Litigation' Clause in Foreign-Related Commercial Contracts)",
      "problem": "Issue: When parties to a foreign-related service contract agree that disputes shall 'first' be resolved by arbitration at SIAC, and if parties 'cannot reach agreement on the arbitration result,' any party may bring litigation—is such 'arbitration-first-then-litigation' clause valid? Does the invalidity of the litigation clause (violating the one-arbitration-finality principle) affect the validity of the arbitration clause? Should courts dismiss the plaintiff's lawsuit and refer the dispute to arbitration? Guidance: Distinguish 'arbitration-first-then-litigation' (sequential, with arbitration as the primary method) from 'arbitration-or-litigation' (alternative, allowing parties to choose either). When a clause clearly provides for arbitration first and litigation only afterward (even if the 'afterward' trigger is invalid), it reflects the parties' primary intent to arbitrate. Apply severability: assess the arbitration clause and litigation clause independently. The arbitration clause (specifying a definite, unique arbitral institution) is valid under PRC Arbitration Law. The litigation clause violates PRC Arbitration Law Art. 9 (one-arbitration-finality) and is invalid. The invalidity of part does not affect the other part. Since the valid arbitration clause takes priority, courts must dismiss the lawsuit.",
      "prompt_tips": {
        "laws": [
          "PRC Arbitration Law Article 9",
          "PRC Arbitration Law Article 16",
          "PRC Law on Application of Law for Foreign-Related Civil Relations Article 18",
          "PRC Contract Law Article 56 (now PRC Civil Code Article 156)"
        ],
        "judgment_guidance": "For foreign-related disputes, determine applicable law for arbitration agreement per conflict rules (Art. 18 of Foreign-Related Law); if parties choose PRC law or contract stipulates PRC law governs dispute resolution, apply PRC law. An arbitration clause is valid under PRC Arbitration Law Art. 16 if it specifies a definite arbitral institution. Assess whether the dispute-resolution clause is 'arbitration-or-litigation' (invalid, giving parties option to choose) vs. 'arbitration-first-then-litigation' (arbitration clause valid, litigation clause invalid). Key textual markers: 'first through arbitration,' 'if parties cannot agree on arbitration result, then litigation'—this sequence shows arbitration is primary; the litigation trigger ('cannot agree on result') violates one-finality principle (Art. 9) and is void. Apply severability (Contract Law Art. 56 / Civil Code Art. 156): partial invalidity does not affect the valid portion. Since the arbitration clause is valid and primary, dismiss the lawsuit; plaintiff must submit dispute to the agreed arbitral institution. Do not treat the clause as wholly invalid merely because the litigation fallback is invalid."
      },
      "expected_verdict": "First-instance (Shanghai Pudong District Court): Plaintiff's lawsuit dismissed; case should be submitted to Singapore International Arbitration Centre (SIAC). Second-instance (Shanghai No.1 Intermediate Court, with Shanghai High Court review): Appeal dismissed, original ruling affirmed; arbitration clause valid, litigation clause invalid due to violation of one-finality principle; severability applies; parties must arbitrate.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "foreign-related commercial dispute / arbitration agreement validity / arbitration-first-then-litigation / severability"
    },
    {
      "id": "legal_057",
      "title": "Anhui Mingbo Law Firm v. China Jiangsu International Economic and Technical Cooperation Group Co. — Legal Service Contract Dispute (Simulated Sale Disguising Loan & Trustee's Negligence Liability)",
      "problem": "Issue: When parties enter into a 'proxy purchase contract' for steel with one party providing funding and earning fixed monthly returns regardless of actual delivery, while funds circulate in a closed loop among affiliates, is the legal relationship a sale/agency or inter-enterprise lending? In such disguised transactions, does the nominal 'transfer of ownership' truly occur, and who bears the risk of goods? When a trustee fails to adequately perform duties under a subsequent 'commission agreement' to recover losses, under what conditions is the trustee liable for the principal's damages? Guidance: Identify simulated acts (通谋虚伪行为) by examining: (1) contract substance (fixed return vs. resale profit), (2) genuine goods flow (closed-loop funds, no real transfer), (3) risk allocation (all risk on nominal buyer). If the arrangement is actually inter-enterprise lending disguised as trade financing, the hidden legal relationship (loan) governs; stipulations on 'goods ownership transfer' are merely façade to maintain the sale appearance and do not cause actual transfer. For trustee liability under PRC Contract Law Art. 406 (now Civil Code Art. 929), assess: (1) whether trustee's conduct constitutes gross negligence or willful misconduct, (2) whether principal suffered ascertainable loss, (3) whether causal link exists between trustee's breach and the loss. If the loss stems from third-party wrongdoing (e.g., warehouse operator's fraudulent pledge) rather than trustee's inaction, no causal link exists; trustee may be liable only for incremental losses (e.g., statute-of-limitations loss) directly caused by delay in asserting rights.",
      "prompt_tips": {
        "laws": [
          "PRC Contract Law (1999) Article 406(1) (now PRC Civil Code Article 929(1))",
          "SPC Provisions on Private Lending Cases (2015) Article 11 (2020 revision Article 10)",
          "PRC Contract Law Articles on sale, agency, commission"
        ],
        "judgment_guidance": "Step 1: Characterize the underlying transaction. Examine contract terms: if party A 'purchases' goods via party B's funding with: (a) B's return = fixed monthly rate × B's outlay, unrelated to resale price; (b) all delivery/quality risk borne by A; (c) funds from A's affiliate cycle back to B through A—this is inter-enterprise lending, not sale or trade financing. Step 2: Determine whether goods/ownership actually transferred. In simulated sale-loan arrangements, stipulations on delivery and ownership transfer are part of the façade; apply优势证据 (preponderance of evidence): if evidence shows (i) the 'buyer' (borrower) retained control of goods in warehouse, (ii) 'buyer' claimed ownership in third-party litigation, (iii) original legal representative of 'buyer' stated goods remained under 'buyer' despite documents showing transfer—goods/ownership never truly moved; even if documents appear to show transfer, treat as constructive delivery (指示交付) completed in favor of buyer/borrower, who bears all risk per the hidden loan agreement. Step 3: Assess trustee's liability under commission agreement. For breach of duty by trustee (e.g., failing to file lawsuit as instructed), apply Contract Law Art. 406: (a) Trustee liable only for loss caused by intent or gross negligence; (b) Principal must prove ascertainable loss; (c) Causal link required. If goods were lost due to warehouse operator's independent fraud (pledging goods without authority), that loss is not caused by trustee's inaction; principal retains right to sue wrongdoer directly. Trustee may be liable for delay-related losses (e.g., extended interest, potential statute expiry) if trustee's inaction materially delayed principal's remedies—but such loss must be quantified; if principal has not yet exhausted other remedies, the quantum of trustee-caused loss is indeterminate and should be reserved for separate proceedings. Step 4: In debt-assignment cases, if law firm accepts assignment of creditor's claim against the 'lender' (who was actually lender, not seller), re-characterize the claim as return of loan principal (not refund of 'purchase price'); original obligor is the actual borrower (not the 'lender'), and guarantors remain liable per guarantee agreements."
      },
      "expected_verdict": "First-instance (Ma'anshan Huashan District Court, 2017): China Jiangsu Co. to pay law firm RMB 18,822,854.40; other claims dismissed. Second-instance (Ma'anshan Intermediate Court, 2018): Appeal dismissed, original judgment affirmed. Retrial (Anhui High People's Court, 2021): (1) First- and second-instance judgments vacated; (2) Anhui Zhonghang Co. (actual debtor/borrower) to pay law firm RMB 18,931,004; Nanjing Shangjie Co. and Anhui Jindu Guarantee Co. jointly liable as guarantors; (3) Other claims (against China Jiangsu Co. as 'refund of purchase price') dismissed. Reasoning corrected: true legal relationship is inter-enterprise loan; 'lender' (China Jiangsu) has no refund obligation; original 'borrower' (Nanjing Shangjie, controlled by Anhui Zhonghang) and its guarantors liable for debt assigned to law firm.",
      "difficulty": "hard",
      "category": "legal",
      "subcategory": "legal service contract / simulated sale disguising loan / trustee negligence / debt assignment"
    },
    {
      "id": "legal_058",
      "title": "Anhui Xincheng Financial Leasing Co. v. Leshan Shawan Zhongsheng Ceramics Co. & Leshan Commercial Bank Shawan Branch — Finance Lease Contract (Invalidity of Unauthorized Mortgage of Marked & Registered Leased Property)",
      "problem": "Issue: During a finance lease, when the lessor has (1) affixed conspicuous ownership markings on the leased equipment, (2) completed initial registration in the PBOC Credit Reference Center's finance lease registry, and (3) noted ownership retention on VAT invoices, may the lessee mortgage the leased property to a bank without the lessor's consent? Can the mortgagee bank invoke bona fide third-party protection under Property Law Art. 106 to defend its mortgage rights? What are the legal consequences of such unauthorized mortgage? Guidance: Under Contract Law Arts. 237 & 242, ownership of leased property remains with the lessor throughout the lease term until full payment and issuance of an ownership transfer certificate. The lessee has no authority to dispose of (mortgage, sell, or pledge) the leased property without lessor's consent. Unauthorized disposition is invalid. SPC Finance Lease Interpretation Art. 9 excludes bona fide acquisition when: (a) lessor has marked the property conspicuously, or (b) third party failed to conduct required finance lease registry查询 per banking industry regulations. When both exclusions apply, the mortgagee cannot claim bona fide third-party status; the mortgage is void and registration must be cancelled.",
      "prompt_tips": {
        "laws": [
          "PRC Contract Law Articles 237, 242",
          "PRC Property Law Article 106 (bona fide acquisition)",
          "PRC Property Law Article 180 (mortgage creation)",
          "PRC Security Law Article 34",
          "SPC Interpretation on Finance Lease Contract Disputes Article 9"
        ],
        "judgment_guidance": "Step 1: Establish lessor's ownership. Under Contract Law Art. 242, lessor retains ownership until lessee pays all rent and lessor issues ownership transfer certificate. Verify ownership via: finance lease contract, purchase contract, PBOC registry record, VAT invoices noting ownership retention, prior court judgment confirming ownership. Step 2: Assess validity of lessee's mortgage act. Lessee has only possessory rights, not ownership; unauthorized mortgage of another's property violates Property Law Art. 180 and is void. Step 3: Evaluate whether mortgagee qualifies as bona fide third party under Property Law Art. 106. SPC Finance Lease Interpretation Art. 9 bars bona fide acquisition when either: (a) Lessor marked property conspicuously (e.g., label stating 'This equipment is leased property owned by [Lessor]'); or (b) Third party failed to conduct finance lease registry查询 as required by law/regulation/industry practice. For banks, banking regulations require checking PBOC finance lease registry before accepting equipment as collateral. Step 4: Apply exclusions. If lessor (i) affixed ownership labels on equipment, (ii) noted ownership retention on invoices, (iii) registered lease in PBOC system, and mortgagee bank (iv) did not query registry, (v) did not request original VAT invoices to verify ownership—bank fails both prongs: should have known from markings, and failed mandatory查询. Bank is not bona fide; cannot acquire valid mortgage. Step 5: Remedies. Declare mortgage invalid; order lessee and bank to cancel mortgage registration at local AIC (Administration for Industry and Commerce) within 30 days of judgment."
      },
      "expected_verdict": "First-instance (Leshan Shawan District Court, 2015): (1) Lessee's mortgage of lessor's leased equipment to bank declared invalid; (2) Lessee and bank to cancel mortgage registration at Shawan AIC within 30 days. Neither party appealed; judgment final.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "finance lease / unauthorized mortgage of leased property / bona fide acquisition exclusion / ownership marking & registry"
    },
    {
      "id": "legal_059",
      "title": "Person A v. Person B — Partnership Tort Debt Recourse (Creditor's Partial Discharge Cannot Bar Co-Obligor's Recourse)",
      "problem": "Issue: When joint tortfeasors (partners in a business venture) bear joint and several liability to a victim, and the victim unilaterally discharges one tortfeasor from further liability without notifying the other, does that discharge bar the other tortfeasor—who later pays the full remaining debt—from seeking recourse against the discharged tortfeasor based on their internal share agreement? May the discharged partner invoke the victim's discharge to defeat recourse claims by the co-obligor who performed? Guidance: Distinguish the external relationship (joint and several liability to the victim) from the internal relationship (proportional shares among partners). A victim's unilateral discharge of one joint obligor's external liability does not alter the internal proportional obligations among partners. When one partner pays more than his internal share, he retains the right to recourse from co-partners for their respective shares, and the discharged partner cannot use the victim's discharge as a defense against recourse—the discharge affects only the victim-obligor relationship, not inter-obligor recourse rights.",
      "prompt_tips": {
        "laws": [
          "PRC General Principles of Civil Law (2009 revision) Article 35 (partnership joint liability)",
          "PRC Civil Procedure Law (2007 revision) Articles 128, 153",
          "General principles of joint and several liability and recourse rights"
        ],
        "judgment_guidance": "Step 1: Establish joint and several liability. Under General Principles Art. 35, partners engaged in partnership business bear joint and several liability for partnership debts and torts. Here, both partners jointly owned the vehicle; the tort occurred during partnership business; court judgment confirmed their joint and several liability to victim for RMB 66,590.77. Step 2: Analyze the victim-Partner B settlement. In 2000, Partner B paid victim RMB 11,000; victim's agent signed agreement stating victim 'will not require Partner B to continue bearing liability and other joint liability.' This discharge was made without notice to Partner A and does not bind Partner A. Key: victim retains full claim against Partner A for entire remaining debt (not reduced by Partner B's payment). Step 3: Analyze the victim-Partner A settlement. In 2011, Partner A paid victim RMB 102,000 (remaining principal plus accumulated delay-performance interest). Victim and Partner A expressly agreed: 'Partner A reserves right to recourse against Partner B for Partner B's share.' This confirms victim did not truly discharge total debt, only allowed Partner B to stop being pursued. Step 4: Determine internal shares. Partners' 1997 withdrawal-of-capital agreement stipulated: 'For the 1997-06-02 accident, both parties bear half each.' This is a valid internal allocation. Step 5: Calculate recourse amount. Partner A paid total RMB 102,000 (after deducting Partner B's RMB 11,000). Under internal 50-50 split, each should bear half of total debt. Court calculates: original judgment principal + legitimate delay interest, allocate 50-50, then deduct what each has paid; Partner A's overpayment = amount Partner A can recourse from Partner B. Step 6: Reject 'discharge as defense' argument. Partner B argues victim discharged him, so he owes nothing. Reject: (a) Victim's discharge affects only victim's right to pursue Partner B; does not extinguish Partner B's internal obligation to Partner A. (b) Recourse right arises from internal share agreement and law of joint obligations, independent of victim's enforcement choice. (c) If discharge could bar recourse, it would enable one partner to externalize his share onto co-partner via side deal with victim—unjust and contrary to partnership equity. Conclusion: Partner B must pay Partner A the amount by which Partner A's payment exceeded Partner A's 50% internal share."
      },
      "expected_verdict": "First-instance (Huai'an Huaiyin District Court, 2012): Partner B to pay Partner A RMB 18,645.39 (overpaid principal share) plus RMB 20,696.38 (corresponding delay interest share), totaling RMB 39,341.77; other claims (vehicle detention loss) dismissed. Second-instance (Huai'an Intermediate Court, 2012): Appeal dismissed, original judgment affirmed. Reasoning: Victim's discharge of Partner B does not preclude Partner A's recourse; internal share agreement (50-50) governs recourse; Partner B cannot use victim's discharge to avoid internal obligation.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "partnership tort liability / joint and several liability / recourse rights / creditor's partial discharge"
    },
    {
      "id": "legal_060",
      "title": "Beijing Danyao Real Estate Co. v. Person A & Person B — Commercial Housing Sales Contract Dispute (Losses from Delayed Performance of Final Judgment Should Be Resolved in Enforcement Proceedings)",
      "problem": "Issue: When a final judgment orders the buyer to return property to the seller, and the buyer fails to comply, may the seller file a new lawsuit seeking (1) an order to return the property (already adjudicated), and (2) compensation for the buyer's continued occupancy during the enforcement period? Does such a new lawsuit violate the res judicata principle? Should claims for losses arising from delayed performance of a non-monetary obligation in a final judgment be resolved through a new litigation or through the enforcement proceeding? Guidance: Apply the res judicata (一事不再理) principle: matters already decided by a final judgment cannot be re-litigated. The obligation to return property was adjudicated in the prior judgment; a new suit for the same relief is barred. For losses caused by the judgment debtor's failure to perform a non-monetary obligation (e.g., continued occupancy during enforcement delay), CPL Art. 229 and SPC CPL Opinion Art. 295 require the judgment creditor to seek relief within the enforcement proceeding, not by filing a new lawsuit. The enforcement court has authority to determine compensatory measures for non-performance.",
      "prompt_tips": {
        "laws": [
          "PRC Civil Procedure Law (2007 revision) Article 108(1)(iv) (lawsuit acceptance conditions)",
          "PRC Civil Procedure Law (2007 revision) Article 229 (enforcement of non-monetary obligations)",
          "PRC Civil Procedure Law (2007 revision) Article 154 (second-instance ruling authority)",
          "SPC Opinions on Application of CPL Article 295 (enforcement of non-monetary obligations)"
        ],
        "judgment_guidance": "Step 1: Identify prior final judgment. In 2004, Beijing No.2 Intermediate Court final judgment: (a) terminated sales contract, (b) ordered Person A & B to return property to developer, (c) ordered developer to refund purchase price. Step 2: Apply res judicata to claim (1) — return of property. Developer's new lawsuit seeks order for Person A & B to return property. This relief was already granted in 2004 judgment; requesting same relief violates CPL Art. 108(1)(iv) (no litigation over matters already decided). Developer should enforce 2004 judgment, not re-litigate. Dismiss claim (1) for lack of standing to sue. Step 3: Characterize claim (2) — occupancy fees during delay. Developer seeks RMB 1,764,719.26 for Person A & B's occupancy from Dec. 16, 2004 to Dec. 31, 2009 (enforcement period). This is not a separate contract or tort claim; it is a claim for losses arising from judgment debtor's failure to timely perform the non-monetary obligation (return property) ordered in the 2004 judgment. Step 4: Apply CPL Art. 229 & SPC Opinion Art. 295. CPL Art. 229 governs enforcement when judgment debtor fails to perform non-monetary obligation; court may compel performance or order compensatory measures. SPC Opinion Art. 295 clarifies: when judgment debtor delays performance of non-monetary obligation, judgment creditor should request relief (including compensation for delay) from the enforcement court within the enforcement proceeding, not file new lawsuit. Rationale: enforcement court has authority over execution matters, including remedies for non-compliance; duplicative litigation wastes resources and risks conflicting rulings. Step 5: Bankruptcy context does not alter procedural rule. Developer entered bankruptcy in 2005; bankruptcy administrator took over in 2007. Bankruptcy does not create exception to CPL Art. 229; administrator must pursue occupancy-fee claim in enforcement proceeding. Conclusion: Dismiss both claims for improper procedure—claim (1) barred by res judicata, claim (2) must be pursued in enforcement not litigation."
      },
      "expected_verdict": "First-instance court: Lawsuit dismissed per CPL Art. 108(1)(iv) and Art. 229; (1) return-of-property claim barred by res judicata (2004 judgment already decided); (2) occupancy-fee claim must be resolved in enforcement proceeding per CPL Art. 229, not new litigation. Second-instance (Beijing High People's Court): Appeal dismissed, original ruling affirmed. Reasoning: prior final judgment precludes re-litigation of return obligation; losses from delayed performance of non-monetary obligation should be claimed in enforcement proceeding per CPL Art. 229 and SPC Opinion Art. 295, decided by enforcement court.",
      "difficulty": "medium",
      "category": "legal",
      "subcategory": "civil procedure / res judicata / enforcement of non-monetary obligations / delayed-performance losses"
    },
    {
      "id": "legal_061",
      "title": "Beijing Heli Huatong Auto Service Co. v. Person A — Sales Contract Dispute (Seller's Failure to Disclose Pre-Delivery Repair as Fraud Under Consumer Protection Law)",
      "problem": "Issue: When a consumer purchases a vehicle for personal use and the seller delivers a vehicle that underwent body repair (sheet metal work and repainting) before delivery without disclosing this defect, does the seller's conduct constitute fraud under the Consumer Protection Law? Is the buyer entitled to rescind the contract and claim double damages under CPL Art. 49? Does price discount alone prove the seller disclosed the defect? Guidance: Buyers purchasing goods for personal consumption (not business use) are consumers protected by CPL Art. 2. Sellers owe a duty to disclose all material defects. Concealing pre-sale repairs on a vehicle sold as 'new' constitutes fraud. Price discounts and gifts are common sales tactics and do not, without more, prove defect disclosure. A delivery receipt noting repair that is retained solely by seller and disputed by buyer is insufficient to prove disclosure. Fraud entitles consumer to contract rescission plus double-damage compensation per CPL Art. 49.",
      "prompt_tips": {
        "laws": [
          "PRC Consumer Protection Law Article 2 (consumer definition)",
          "PRC Consumer Protection Law Article 49 (double damages for fraud)",
          "General principles of defect disclosure duty in sales contracts"
        ],
        "judgment_guidance": "Step 1: Determine if CPL applies. Buyer purchased vehicle for personal use (not business); buyer is a consumer per CPL Art. 2; CPL governs. Step 2: Identify seller's disclosure duty. Sales contract stated vehicle is 'new' with only 18km mileage. Vehicle actually underwent repair (right-side sheet metal, repainting, parts replacement) on Jan. 17, 2007 before Feb. 28 delivery. Material defect: repaired vehicle ≠ 'new' vehicle. Seller has duty to disclose. Step 3: Assess whether seller disclosed. Seller claims: (a) price discount (151,900 → 138,000) and gifts prove disclosure. Reject: discounts/gifts are standard sales practices, not proof of disclosure. (b) Delivery receipt signed by buyer notes 'right-side body repair, sold at agreed price.' Reject: receipt held solely by seller, disputed by buyer, written by different persons in remark column—insufficient to prove buyer knew of repair at time of signing. Conclusion: seller failed to disclose, concealed defect. Step 4: Determine if concealment = fraud. Seller knew of repair, intentionally withheld information, buyer relied on 'new car' representation, buyer suffered loss (paid new-car price for repaired car). Fraud established. Step 5: Apply CPL Art. 49 remedies. Consumer may: (a) rescind contract; (b) obtain refund of purchase price RMB 138,000; (c) recover incidental losses (tax, service fee, insurance); (d) obtain double damages = RMB 138,000. Total relief: refund + incidental costs + double damages."
      },
      "expected_verdict": "First-instance (Beijing Chaoyang District Court, 2007): (1) Contract rescinded; (2) Person A to return vehicle; (3) Seller to refund RMB 124,200 purchase price; (4) Seller to compensate tax RMB 12,400, service fee RMB 500, insurance RMB 6,060; (5) Seller to pay double damages RMB 138,000; other claims dismissed. Second-instance (Beijing No.2 Intermediate Court, 2008): Appeal dismissed, original judgment affirmed. Seller's fraud established; CPL Art. 49 double damages properly awarded.",
      "difficulty": "easy",
      "category": "legal",
      "subcategory": "consumer protection / sales contract fraud / defect disclosure duty / double damages"
    }
  ],
  "count": 61,
  "metadata": {
    "source": "data/legal_dataset.json",
    "format": "json",
    "dataset_type": "legal",
    "schema_note": "Each item includes an issue, tips (laws and judgment guidance), and an expected verdict. Output requirements should align with the expected verdict. All natural-person names have been anonymized."
  }
}
